{
  "rating": 2,
  "title": "Smells odd",
  "text": "It’s okay not the greatest and doesn’t have any “magical” effect like others have said. Smells like old lady perfume no matter who it’s on male or female.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFSCQMP2EPYLGJN7OBTMEXCBE2OQ",
  "timestamp": 1609008588813,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Didn’t see the value",
  "text": "I loved the scent going on but in about 3-5 minutes I could no longer smell it. I asked others if they could smell it on me and they couldn’t smell the scent. I know things smell differently on others but this is supposed to bring out the best smell on you? Not very pleased, wouldn’t buy or recommend",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGZMNRT6ZFT7DFQDDTL2NWJGECZQ",
  "timestamp": 1647300757552,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "These men will be all over you. Be careful sis💕",
  "text": "Y’all I barely put a few dabs on my neck and my wrist when I go out and the response from men is crazy. I’ve never had a challenging time attracting men…let’s face it if you’re a woman and you are in your feminine energy you will attract men period. However, this product turns it up a notch. Just be mindful though because it is a little shocking at first how strong their attraction is to you…it’s almost like it’s animalistic in a way. That being said, I’ve decided to only wear this when I’m on a date. Be safe out there ladies. This stuff works a little too well. Oh! There is also a massage lotion made by the same company.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEGQBHPAOKIRSBB47KZGTDPPNUTA",
  "timestamp": 1647999251093,
  "helpful_vote": 17,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "WHAT?!",
  "text": "Ummm... Sorcery. Sorcery! This is magic and I'm shook to my core! I was hesitant but hey, TikTok told me to buy... 0 regrets! My main squeeze has been like a mini human who clings for dear life against me when I wear it. I've had it for a couple weeks and have worn it for 5 days straight. results=man is obsessed with me. I decided maybe this was too good to be true so I stopped wearing it, believing maybe it was just that he loved me so damn much....NO. I was wrong. LOL. Days where this was not worn I did not get a slap on the booty or a cling for dear life. I wore it again the past 2 days and guess what!???!!! He's alllllllllllll over me. Love this stuff so much. The scent is light and fruity.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF6L6GCILOYQXOUT2K2MJD7EQFXA",
  "timestamp": 1621953194191,
  "helpful_vote": 3,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Good",
  "text": "Nice throwback to the 2000s",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHVZVOTCYCNGJIBJC2F5HOYFBKVA",
  "timestamp": 1666304040842,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Smells good",
  "text": "Can’t say that it “works” but it does smell good. Lol",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFRM5WRAZY3MNJORCPJZOCSYQLBQ",
  "timestamp": 1629049552624,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Doesn't do anything",
  "text": "This product doesn't actually do anything, but it does smell really nice.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AELCQE7V3LJH45MGX6CHPCS537NQ",
  "timestamp": 1633620163174,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Nice smell but didn't do anything for me",
  "text": "Honestly the only reason I purchased this was to see if it did anything or if it was noticeable. I've worn it 4-5 times and unfortunately, it didn't seem to have any effect on anyone close to me whenever I went out. Not even on my fiancé, and he didn't realize I was wearing a different scent until I showed him the bottle. But he did reassure me I didn't need some pheromone oil to be attractive to him so that was nice.<br /><br />It does smell really good, to me it's like a pleasant floral with a hint of citrus. The scent however didn't last very long on me and I've reapplied it at least twice in one day. That being said, my skin tends to absorb oils very quickly and as a result I don't use perfume oils very often.<br /><br />It might work better for someone else though, and I've been told it's exactly the same as the MLM Pure Romance's pheromone oil and much less expensive.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEAUGLA76RMNUODPJPCY327QG3QA",
  "timestamp": 1621289894190,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Sweet smell, results unsure",
  "text": "The scent is sweet and fruity, I can’t smell it after an hour. I’m not sure if it actually works, but I enjoy the sweet smell. I will say the first day I wore it, toward the end of the day my husband grabbed me in a passionate embrace and kiss before the kids interrupted. It was rather inordinate for the time and place, but I haven’t had enough experience with the product to relate it to the event. I will continue wearing it and provide a more detailed review in a few weeks.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEH4XDBEFI2ENTTCMGTMKPS7WJUQ",
  "timestamp": 1560884858386,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "No difference, so no effect",
  "text": "I don’t notice any difference, the scent is nice but is not doing even half of the effect other people are writing in their reviews,",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHDQ7ZY2DLYGV3NKBLUBMET34DAQ",
  "timestamp": 1666203725604,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "He’s not interested",
  "text": "I read negative reviews but really wanted this to work. Unfortunately, I’ve been wearing it for the past week with high hopes and my husband still hasn’t touched me. So, no, it’s not some magical sex potion that will attract your mate. That being said - the scent itself isn’t bad. It smells like a light sweet sweat, so if anything it does make me think of sex a bit. That’s the only reason I gave it 2 stars instead of 1. Unfortunately, it doesn’t seem to affect my man at all, and if it does it’s in a negative way.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEPVOSVUMK7SVTKPTZQ4L46S754Q",
  "timestamp": 1633564844856,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells amazing",
  "text": "The smell is really nice! I think it’s cool that it smells different depending on who puts it on.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHMTYWDYZUBCIUL4UGSOILOJLWMA",
  "timestamp": 1609038471529,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Pure Instinct is the best",
  "text": "I receive compliments every time I wear it over the years. The roll on is by far the best application.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFT4W2465OIOJDMCJRHO5F6O575Q",
  "timestamp": 1676547914236,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it",
  "text": "My daughter is happy with it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH4NV5I7WLS5GYM5NTQVV6KHSVNQ",
  "timestamp": 1655584321197,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Eh, it’s alright",
  "text": "Lol definitely didn’t work. Not that I needed help in that department, but this was purchased mainly as an experiment. Husband didn’t even notice I had it on. Although I feel like it’s good quality, I did not like the scent at all, it’s just not my taste though so don’t let that deter you",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEX4JBD7JLWRD6VW6NRGUXQRX46A",
  "timestamp": 1611001161049,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Buy And Try",
  "text": "I haven’t noticed any significant changes in the way I was treated as I am naturally a charmer. I do like the thought. The smell is delightful and inviting however doesn’t last long even though it feels like an oil.  I don’t regret the purchase and would purchase again based off scent alone. I would be lying if I said it doesn’t give off some type of calming feeling through the scent. So buy and try.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGCVIHVF5DVI4R6WZW4JUEORMYIQ",
  "timestamp": 1596901781459,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "My interview secret weapon",
  "text": "It’s not going to just have the opposite sex floating to you but people overall seem more open and friendly towards me. It also helps my mood when I need a boost myself.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHVAUNQT4QYCQRNS5THE5GIRWUWQ",
  "timestamp": 1546131566924,
  "helpful_vote": 78,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I like it.  I'm ordering my 3rd roll on bottle.  I like to keep one in travel bag.  Mild, pleasant, He likes it on me",
  "text": "This is such a mild scent, you'll think it's not working.  But my husband seems to snuggle more and says I smell nice when he's holding me.  It's almost like you just took a fresh bath, but not really like soap smell.  More a light musky with other tones.  I put it on almost every day, and put something else on top of it if I want a different stronger fragrance.  I always smell the lid of the one I plan to put on top of this to make sure they blend.  Someone commented that it smells like coconut.  NOT to me!  My husband hates the coconut smell, and he would have commented about that.  He likes it!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGAD4ETZN5G5YJQVH4FATXHHAQCA",
  "timestamp": 1499499342523,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 5,
  "title": "Saved my relationship",
  "text": "This might sound crazy but this saved my relationship. My partner didnt want to participate in adult activities. He said he couldn’t get in the mood. This changed everything!!! He now takes me to pound town every night!! Highly recommend!! 10/10",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AETHE2BB5YZ2XPT7CAI4TOY4XF2Q",
  "timestamp": 1621887993171,
  "helpful_vote": 16,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I Like It",
  "text": "It had a soft powdery citrus type smell.  I haven't worn it around the opposite sex yet.  I can see why the scent would come across as smelling like an old lady. I will try mixing it with my normal perfume and come back and update this review.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEURHBJYHH4DEXIEJWEZ2B66BHSQ",
  "timestamp": 1629225154140,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells nice",
  "text": "Not sure that it does anything magical, but it smells nice.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHRW5RWMBFDMXMJ3OTVOJOBY3KVQ",
  "timestamp": 1648733405351,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Meh",
  "text": "Unfortunately the scen is too fruity for me",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFU4HBIJOFEIDX3H3ZXKFU6Q7EHA",
  "timestamp": 1603048899039,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Older woman smell",
  "text": "I can’t stand the scent of this, it has an older woman smell and makes me nauseous. Do not recommend",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH5H7KMOE6KYXYTIOYAK7D2HJUAA",
  "timestamp": 1662734666086,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I think this stuff works for random street men but IDK about husbands 😁",
  "text": "I love the scent of this. It may smell different if you smell the rollerball before you add it on your skin or if you roll it anywhere else because it reacts to your own body. I rubbed it on my wrist, then my daughter rubbed it on hers and I had my other daughter rub it on hers and we all smelled differently.<br />They say this is used as a pheromone and may attract people. I dont know if that is true 100% but I do know the couple times I used it, I DID have some odd, more blatant flirting by men than I normally would.<br /><br />Here are just 3 examples when I wore it: (these are 1000% true and not fabricated one bit)<br /><br />When I went to a food drive thru, I handed this guy my card at the first window. While I was waiting in line to drive to the next window and I seen him walk to the other window to talk to the other guy that will give me my food.  I pull up and grab my bag of food from this guy and after that, he walked away and a moment later A DIFFERENT guy came over and gave me my drinks. After this I had to wait for a minute because they didnt put any sauces in my bag and the window was still open a bit ( idk why but that little window thing wasnt closed all the way) and I HEARD THEM TALKING ABOUT ME. I just drove off without my sauces because I didnt know what to do 😂<br /><br />The next time I wore this stuff, my daughter and I went to our local flea market and wanted to shop all day and just get out of the house. We like to go there once a month because its a fun thing to do in our small(ish) country town. We were there for about 2 hours and I cannot tell you how many times I got hit on, whistled at and just straight up ogled at. To the point my daughter and I even asked each other a few times what was going on here because that type of stuff never happened when we went. This guy walked up to us and asked if I was single (I had a wedding ring on), people were saying my daughter (who is 15) and I looked like sisters and at this one booth this guy gave us a discount for the \"pretty ladies\" 😂😂 OK. I AM NOT GONNA LIE. THAT WAS NICE.<br /><br />Another time I was in Walmart doing some grocery shopping and I was almost done I just needed to get waters for our house because my kids drink so so much of it. So as I was walking to the water aisle, I noticed this fit looking guy in the middle next to me standing there looking at the lunchmeat. But he was kind of eyeing me. I just KNEW he was going to go to the dang water aisle too. And what does he do? He follows me to the water aisle. I am about halfway there and he LITERALLY PUTS HIS CART IN FRONT OF MINE TO STOP ME. He asks me if I work out 😏 I told him no, he said he is a personal trainer and he thinks he used to train me. I was thinking really, thats the line you came up with? So I told him no I have never done that in my life. He asked if I want to I said no but why don't you just give me your email or something and I will let you know. I didn't want to be rude and I wasn't planning to email him at all. He legit told me he don't have an email address and he would have to text me. That was such a lie. My 8 year old nephew probably has an email. I told him that my husband wouldnt like that very much. Then he said WE CAN JUST MEET UP HERE INSTEAD. 🥱 He was trying so hard. I told him no thanks then turned around and once again said forget the waters because he blocked my path and I wanted to just get away.<br /><br />But the oddest thing about this whole pheromone perfume is, my husband hasn't really noticed it much or should I say, hasn'tsnt RAVAGED me more because of it. I haven't used it again in a while but I do really love the smell so maybe I will when I go to the store later. Who knows, maybe I will get all my groceries put in my car for me by some random person walking or something....😁",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG4ELVUDBHS5HRYEYCM4SLQF44DQ",
  "timestamp": 1631116249905,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Omg my fiance couldn't keep his hands off me !!!",
  "text": "I definitely recommend i put it on that night and the next morning he still couldn't keep his hands off me!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG6ULG6AEQERAWBGLL2IVKLRCKFA",
  "timestamp": 1640581027289,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smell very good - selfteam great",
  "text": "This product work as describe is great item....",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGRBPW2FQSROLHJYKVDS4RL34NRA",
  "timestamp": 1535070288931,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "If hot B-O, spoiled hamburgers is your scent.....this is for you!",
  "text": "The scent is subtle for 2.5 seconds, then quickly is a nauseating hot garbage scent. Maybe it was just me but these reviews had me sold and it’s truly a nauseating scent a shower could not relieve twice over. Two swipes of the roller made me and my household nauseous. My kid even asked me if I had forgotten deodorant because I was hurting their feelings. I’m happy this works for most of the reviewers but this is like a skunk scent I can’t get rid of. And it’s been half a day with this stuff I set in the the garage til I can return it!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEOC4HKH3LF5PTPF6UA46HKQNG2A",
  "timestamp": 1604974065707,
  "helpful_vote": 30,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Try it",
  "text": "Smells soft . It's very alering . I'll be repurchasing when it's empty.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE55XEBFF3OLDCSAZTHV7FZHIXHA",
  "timestamp": 1613062227982,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Overhyped",
  "text": "It’s just perfume.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFPHNZLXI45D6IBFBPDUSYYEXFOQ",
  "timestamp": 1610441908477,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "I'm on the fence",
  "text": "I'm not sure what I was expecting with this. The scent is intriguing. It changes from minute to minute.it's definitely different on different people - as it should be. I'm unsure about how dramatic the scent change on me is though. Initially it's musky (I love a musk) then it gets sweet, then a dirt smell, then overly sweet. I'll try it again and see how it works out another time. But for now, I'm confused.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGAVHCK42EGMVS7DGPRX6HBCUCNQ",
  "timestamp": 1654572171628,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "A little goes a long way",
  "text": "This product is more of a strong flower scent, and a little tiny bit will do just fine. Shipping was fast, and product was in tact, packaged inside of a box, inside of the amazon bag!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEWNRYGPWTDMYIGYNOGXKKKE5BPA",
  "timestamp": 1640221472308,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it!",
  "text": "I wore another pheromone based perfume in the past that has been discontinued so I tried this one.  I love the smell and after a few hours, it adapts to your body. It stays on all day.  I will definitely buy this again.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGJTFSSKGDXUQKITNAEKXFSG5XCQ",
  "timestamp": 1574781057066,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Not the greatest smell",
  "text": "I have used it quite a few times and it doesnt seem to draw anymore attention that usual perfumes. Also i am not a huge fan of the scent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEXAY4D52HF5HWOIBXHSYAS3RJBA",
  "timestamp": 1605553294454,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "pure garbage",
  "text": "Don't buy this.  i have tested this with several people.  Before exposing these people to this product I had given them full disclosure.  It did nothing for them.  5 men 5 women.  no shown results.  its a scam.  sorry guys.  the reviews that say it absolutely works are just paid jerks that want to sell this snake oil",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHRA4MNCRU6THGDGZAMLPT3VIZUA",
  "timestamp": 1605132284605,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Nope for me",
  "text": "I found the scent of this to be unbearable.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHSZXCJL6TJGVOVCZ4SFUYWDMMZQ",
  "timestamp": 1636939801685,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Scent is off",
  "text": "The scent is a little weird but it works",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEPQI7UWOWBFVPGBW4XP4HADFNLA",
  "timestamp": 1663028741938,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "High hopes.",
  "text": "First off trying this product I was so excited but when I first applied it I instantly became nauseous. I couldn’t keep it on too long before I had to wipe it off. Second my spouse didn’t even notice. Everyone is different I guess but I read some very good reviews and I was disappointed it didn’t work the same for me.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHP5QMXZPAKZFQAA2UXX6UC67JKQ",
  "timestamp": 1615873738580,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Great smell",
  "text": "I honestly haven’t been able to tell a difference on how this smell effects others around me, BUT man does this do something for me. I love the scent and when my vibration is at that level. I feel an intense feeling of lust. I like it a lot.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHS35GYVHQNB5NMFNNUMSJW3RVFA",
  "timestamp": 1610433755633,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Yuck",
  "text": "So this smelled straight up like a cheap floral candle. After I tried it I also found that there was a hole in the cap so I definitely returned it. I absolutely won't be trying it again even though I know that the hole in the cap could have affected it. Nope. The scent was so cloying and strong that it gave me a headache and I only used a tiny bit in the bend of one elbow. Not for me.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFR3CNPSZJU6SRYDJZADAY6YUXOA",
  "timestamp": 1598428513153,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Waste of money.",
  "text": "I would say that this does nothing. Nobody was able to tell I had it on. I have used it multiple times with no reaction, or anybody commenting on a scent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHWA4GFRPLULVWB7OE5UJ63SQ5NA",
  "timestamp": 1644526252402,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Smells like bubble gum",
  "text": "Very sweet smell. Smells like bubble gum.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEZ6PQW6QPBKM764QVZGRZPNLD2Q",
  "timestamp": 1678591780511,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Not at all when it’s cracked up to be",
  "text": "The scent of this smells so good, it’s like a fruity scent. The scent does not last long at all on my skin I had it on for a total of an hour and couldn’t smell it anymore after that, disappointed and a complete waste of money.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFIMOGIW3B34IHZ37ZZ4QLWEPUAA",
  "timestamp": 1638744622131,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Doesn't work for me",
  "text": "Didn't work for me and it smells like oranges.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFL6IKGXL6IOEU2HM2R5VSVLIOWQ",
  "timestamp": 1628143453721,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "I wish it would’ve worked",
  "text": "I tried wearing it around my husband and all I got was “smells nice”. No ripping my clothes off. Not even wanting sex.<br /><br />It smells great, don’t get me wrong. I just wanted the experience other people in the reviews got too. Didn’t happen.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEMHBLYDQ4E7CB5WVJXW2TCMA5LA",
  "timestamp": 1616501482796,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Did not work",
  "text": "I ended up returning this item because I felt as if I got ripped off. I put it on my neck and wrist and my husband didn’t even notice a difference, he didn’t smell it at all. It was a total shock to me because When I applied it it was super strong and I ended up taking a shower again later that day to try to get the smell off me because it a was making me choke and cough. There was no difference I would not recommend. It’s not worth the money and I don’t get the hype.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFXJX4D6JCJ3CSTMNHMZO7HV3NTQ",
  "timestamp": 1678963671690,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Does not work",
  "text": "At first it smells nice but the sweet scent lasts for maybe 30 minutes and then you don't smell anything at all. This should be sold at the dollar store. Definitely not worth the money.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFD7CGSWVYHETN2WTUDI6R7X2M2Q",
  "timestamp": 1640794031920,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Smells Stays, but it doesn't actually work",
  "text": "So I tried this and it didn't do anything. Nothing noticeable. No one smelled it. No one acted differently. And honestly it just smelled like a super floral perfume or something.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHXRDGNQNTFGBJM5RCYN2CASNTJQ",
  "timestamp": 1667705548694,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Just no",
  "text": "Gimmick",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFC2IGKL54G524OJGA6ZI4Z24N2A",
  "timestamp": 1643214155579,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "great addition to perfume",
  "text": "this scent is sort of intoxicating for me to even smell on myself, i don’t wear it by itself although i wouldn’t be completely opposed to it. i don’t know about the “scientific” affect it supposed to have on your partner, but i do know it makes ME feel sexier when i wear it! that counts for something i guess. maybe it’s a placebo affect, but i don’t really care because this one roller will last for years and the smell stays all day!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGZUIEI6DQTG7RVVIKJH6W6M6HYQ",
  "timestamp": 1666471547689,
  "helpful_vote": 25,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It’s just ok",
  "text": "I don’t know if it’s as crazy as ppl hype it up to be...My fiancé didn’t like the smell but I like it...",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFUFVPWXYR7BUPUERKKDQH5M37IQ",
  "timestamp": 1604449186404,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Don't bother",
  "text": "Tried it twice.  Sickening smell...Straight in the garbage...",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEF5HSBW3UAEN3ZR7AWVWEHMTITQ",
  "timestamp": 1642576341596,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Going to try it",
  "text": "I will be trying it out this weekend.  Hopefully it will be a good investment",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHWGN6HAOWU3MDEZR4NZ6BRCBQCQ",
  "timestamp": 1659749691789,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Not worth the hype",
  "text": "The scent is just okay nothing special to it. It doesn’t seem to last that long either. Not a bad purchase and the price isn’t bad for the product.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEU4MK2S5M6QVCM6TBDCNJ3Z7XBQ",
  "timestamp": 1671425072317,
  "helpful_vote": 8,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "It smells… decent… then turns oily",
  "text": "Nothing magical happened… at all. It’s a cute little rollerball full of oil, albeit nicely scented. For the money, pass.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE346SK62NHZ53DURXTPV2URK4ZQ",
  "timestamp": 1674306580050,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Doesn't last very long",
  "text": "I love it!!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEVZQ3N2CSKSUO5YIV6TVJSW5G7A",
  "timestamp": 1666134887669,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "No difference",
  "text": "The scent isn't terrible. Not something I would've picked though. The oil is extremely thick and tacky. I also didn't notice a difference around my SO.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGQRP2QKZMZOVBBEPDZBDMUMUJSQ",
  "timestamp": 1615166534139,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Does not work and isn't a nice smelling perfume either",
  "text": "The caption says it all: I am not a fan of us and I do not think it works at all. I’ve been wearing it every day with my other perfume because I don’t like the smell of this one too much, but nothing has changed.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFLJAAOA5RACED2WBJNLYQY2PH3A",
  "timestamp": 1651956251128,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Actual Same day delivery not a trick on this product",
  "text": "I had purchased my regular order and had an unfortunate experience and my bottle fell out of my purchase and broke. It was my only bottle. In a panic I had to order a new and fast. I was offered same day delivery. It was a bit pricey but hey what’s a girl to do? I actually got my new bottle within 12 hours of ordering!! My bottle top was a different color but a received a note that although the container was different it was the same product. I’m good as long as you can keep the product in stock.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF7KROGHEIP7D457ME22KYOB5SVQ",
  "timestamp": 1611332204473,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Pure instinct oil",
  "text": "Smell good , but pheromones dont work!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH5UTJGIAESGI32YKKSPIXQK4SHA",
  "timestamp": 1610095866396,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells like Pure Romance",
  "text": "I fell in love with the pure romance pheromone roller. This one smells just like it so I’m happy. I can’t speak on longevity. It’s not super strong scent to begin with, but I can do a workout and still smell it on my wrists after.<br />And even if I don’t get hit on by a guy(one time it happened while wearing this), I’m turned on by it. I’ll hit on myself.<br />It’s counter part Crave is a big fail though.<br />Crave= NO<br />Original= YESS!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGFDQUC5UNSEYACL7BSTNKDJUSAA",
  "timestamp": 1666839586029,
  "helpful_vote": 4,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Horrible :(",
  "text": "I have to say, I bought this with really, really high hopes.  When I was first dating my husband I bought a pheromone perfume and it drove him nuts (although he didn't know why...lol), so I know the pheromone perfume works, but this was VERY disappointing.  I had to practically shove his nose on my neck behind my ear to see if he could smell it and his reaction was less than 0 (if that's possible).  I know everyone's chemistry is different, but even when I put it on you can barely smell it and it doesn't last AT ALL.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE6RO5FEVSCMDZ3FHYM3B2EWKELQ",
  "timestamp": 1639697532048,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Please read my entire review for honest thoughts.",
  "text": "All the reviews are good but rather mixed. Until you try it for yourself, you won't know if it's for you or not. As someone else stated, it will only work on someone who is naturally attracted to you already AND someone who CAN SMELL your natural body odor (and likes it). It truly does smell differently for everyone also! I read vanilla a few times and CANNOT smell that. On my body it smells of floral and slight citrus notes. My fiancé loves it and says it does boost my natural body odor or as this product tries to sell - pheromones. Remember, NOT everyone can smell pheromones. This lovely perfume oil DOES ALSO fade within 30 minutes to an hour. I PERSONALLY think this oil is best for date nights, nights out, or even \"sexy time\"... if applied directly before these events. IT IS all around a good product! TRY IT FOR YOURSELF! Just because it fades a bit quickly doesn't mean it's not worth it! It could easily create a more intimate, intense time for you when you decide to use it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AECSNTEQIPDHCOPOIRTMXESQ55PA",
  "timestamp": 1676878066944,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Is it supposed to smell like that?",
  "text": "I ordered this after reading the reviews on how pleasant the smell was.  It smells like a cheap air freshner you get at the car wash.  It almost had a sour, like it was old or had gone bad, smell.  Maybe the one I received was old...not sure, but it wasn't a nice smell.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGOP5NOQG7D2VSDKCZQ5YUW6VS5A",
  "timestamp": 1607746240328,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Keep EVERYONE away with this toxic smell",
  "text": "Here is a brutal honest review of this \"pheromone stick\"<br /><br />With all the tick tock videos, FB advertisements, and reviews who doesn't want to try this out? $14 seems like a steal for the product and all its advertisement.<br /><br />The moment I smelled it upon receiving it in the mail, my stomach turned as though I had digested spoiled food. Yuck.<br /><br />Then again, if you like the smell of coconut, vanilla tree car freshener with a hint of baby powder, then you'll love this smell.<br /><br />Needless to say, when I wore this sparingly, my friends and family did not spare my feelings to let me know how horrible I smelled.<br /><br />When I stopped into a grocery store, Lowes, Home Depot and even greet the hunky men installing a roof over my deck - not one man gave me a 2nd look.  Therefore, this pheromone failed to deliver based on its advertisement and I will be returning this smelly stick.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFXNSKVKWXYIOH7HZIDUSJNJ6DKQ",
  "timestamp": 1636560436478,
  "helpful_vote": 7,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Not for me",
  "text": "I purchased this & I was really hoping for a great smell but I honestly didn’t love it on me. I have heard such great things about it but it’s not for everyone. Thankfully for Amazon I was about to return it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHEBZPRWHVZSGD3AGJYTVIBTMPJA",
  "timestamp": 1661208678727,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Compared to Basic Instinct",
  "text": "I was using Basic Instinct, but it was way pricey which prompted me to try out this product. It's perfect, I can't tell the difference, and it seems to last a while... I just bulk ordered 3 more so I don't run out for a bit. Definitely recommend and will buy again.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGVXRHXDOJGADYVYRFSEBKVB6NHA",
  "timestamp": 1459551594000,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Four Stars",
  "text": "Ok product",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGXWIZ4VV6IWLBV25FSHD3HX5BRA",
  "timestamp": 1435177722000,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it",
  "text": "Love how it applies so easily and how it smells so amazing.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFKLXNQJWSLVQ6PZRQ6R4VTKISBA",
  "timestamp": 1612741215242,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Five Stars",
  "text": "Item exactly as described. Shipping was a bit slow, but arrived.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHZOKTBGFCBPTJTYFIQG3TRLOINA",
  "timestamp": 1437885672000,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Lovely scent but not quite sure it does what I want it to",
  "text": "I would rather give this 3.5 stars than 3. It’s just not quite 4 stars. I like the quality, it smells very nice and soft for the part that is scented. It lasts FOREVER and gets more pleasant as it warms up to your skin. I really enjoy wearing it. But as far as the pheromones go—which was whole point of purchase— it made my significant other more cuddly for SURE, he’s normally not super cuddly at all, and I do feel he was more relaxed (we don’t live together and only get to see each other once a week), he really felt easy going once we got home from our errands. He was keyed up over some stuff and I could feel that energy while we were driving around. So it had zero effect that I could tell in public aside from just me enjoying it. Then when we got home and relaxed he was much more cuddly and loving than normal, especially after having been keyed up. He calmed down easily. We went to relax together and he barely kissed me or anything. This can be normal for us which is WHY I bought this to begin with. I was hoping it would inspire more amorous actions on the spicy side. It did, I fully believe, cause him to cuddle me far far far longer than is normal for him, and to really relax and enjoy that. We had fun and watched our fav shows which is kind of unusual mid day for him before he has to leave for home. So I do think it inspired him to be more loving and cuddly and intimate in THAT way, but it didn’t inspire spiciness like I was hoping and going for. Without this, the weekend before, he was VERY spicy. So I know things are always changing and no one thing is gonna be a cure all. I am going to experiment with it some more and I will update if anything changes. Reply if you’d like an update! Thank you for reading!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFDFORRN6JZ2OUYNHKI6JJDYJ3TQ",
  "timestamp": 1631676255744,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Possible lemon",
  "text": "Smells super sweet and has a odd pungent background fragrance, had multiple people smell it on and off their skin and no one liked the scent.  Not sure if I got a bad one.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEIWII2FP5O4TQP2UOFTQ7TIRLUA",
  "timestamp": 1617148509356,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Smells Good",
  "text": "Honestly it doesn’t work . It smells good , so I continue to wear it . But it doesn’t do anything . Don’t fall for it like I did 🤣",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHUMMQE5LKIL5N3ZSA56NZALB42Q",
  "timestamp": 1614763413951,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Good",
  "text": "I feel like the whole idea of this is a placebo. I have not seen this magically attract anyone more than usual. It’s basically just a roll on perfume with a slight scent. But if you just want a roll on perfume with a nice slight scent then get it. But if you are expecting this to attract everyone to you all the time then I don’t recommend.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHRVURANCAEOCGNFC7FLIF3MSCYA",
  "timestamp": 1638071430939,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "I'm so sad it doesnt work",
  "text": "So I've bought this before and had a drastic difference in the attention I got from people- this last bottle I bought hasnt done anything for me :( idk if it's old, bad batch, or something else but it just hasnt worked the same as previous bottles",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFTIBSBCD3TBR3VN52RGVKYJ2JCA",
  "timestamp": 1632752458987,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Horrible smell",
  "text": "Smells like a gas station bathroom airfreshener. Straight to trash will not use or purchase.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG362XSNR4VR5L2XELFB2CCCRWJA",
  "timestamp": 1620514408393,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Dang :(",
  "text": "The scent was nice to<br />Me, very sweet on. Honestly this hasn’t done anything lol. Worn it around a guy I’m seeing, nothing different, work, nothing different, out with friends, nothing different. Pretty disappointed honestly. I didn’t have any issues with scratching from the roller ball and I don’t believe it was hard to put on",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFSKYQ6UW7VSCJ6NSEJ3IW477PJA",
  "timestamp": 1616730943694,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Smells Nice But That’s It",
  "text": "My husband didn’t even notice I had it on. He had to pretty much put his nose to my neck to smell it but at least he liked the scent. It doesn’t last long though so be sure to carry it in your purse so you can reapply it when needed.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGRY5HJHKZCFKYNGDXRALCX2O3MA",
  "timestamp": 1645159265052,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "It smells awful, in my opinion",
  "text": "It smells like a grandma perfume. Not like any pheromone things I’ve bought before. This will attract no one lol",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH373PSA5CF25RK2ONV2G6CWP3QA",
  "timestamp": 1662850141846,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Please scent. I've used it for years.",
  "text": "Please scent.  I've used it for years.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEEY3VESEG7ZDQVZUZSUWFV6UY6A",
  "timestamp": 1486409274000,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Yes",
  "text": "I really like this and the smell.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFCIYPZACFKSLPXEHLYKTP7M366A",
  "timestamp": 1633300095447,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "it won't attract your partner lol",
  "text": "it has a nice scent.... but isn’t advertised like they say lol,",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH7YXYFOKBGH3XM7DEFV5YQ65IPA",
  "timestamp": 1614289898617,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Love!!",
  "text": "Love the smell and the sheerness of this oil it is very strong so a little goes a long way",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHC6ATML3ZGDEPLTPQAGWTLC35XA",
  "timestamp": 1607068317875,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Smells weird",
  "text": "Idk what the rest of the reviews are coming from because I never got a single compliment or comments whenever I am wearing this. It also is unbearable to smell so I don't like wearing it. How do I explain the smell... it's like old lady perfume. And it makes me gag a bit. If you want to smell like old lady, then get this perfume thing.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFVVUQHKMRXIH3GBTAUNPGLE6VLA",
  "timestamp": 1669412463526,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Did not work!",
  "text": "I saw no difference going out or hanging out with my husband. I don’t mind the smell. It’s pleasant, not over powering. It also doesn’t seem like it last that long. I swear it only lasted for a couple is hours and that’s it.  Not impressed.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AESJU5OCDRPXQQARJME7JW7C6KPQ",
  "timestamp": 1661728916841,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It’s just a wonderful product.",
  "text": "The scent is very wonderful and my mom enjoys it very much! Thank you! It has just attracted her crush to her a lot and made other women jealous.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHQFVGTOOJRZFDW4X53UXTJATBOQ",
  "timestamp": 1603403769841,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Sexy scent, but doesn’t last long",
  "text": "Very nice, sexy scent, got many compliments from men on how I smelled after using this, but it’s gone within 5-6 hours, even with heavy application.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHXLTXFOMCPGOJNEHWNP3YHT26TQ",
  "timestamp": 1679758224065,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Ghostly",
  "text": "I chose the title, for this review, as Ghostly with the reason being is because is nothing is there…no scent. When I opened the roll on, it had a nice fruity-floral scent. When I put it on, and I mean instant skin contact, the scent left. There is a slight odor of a mineral oil, but no lovely floral or fruity scent. The husband didn’t notice anything, either. I’m glad it was just around $6 that was wasted on this. Edit..why was this review hidden??",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGVZOVXHMDR6B4P3Z5UAIG4LJ6AQ",
  "timestamp": 1633793190845,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Meh",
  "text": "Easy to apply but the smell was a bit strong for me. Reminded me of “old woman” perfume or a strong floral scent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEOQ55YV4VB625VCWWIZGBOWXWAA",
  "timestamp": 1623355928820,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "It's a 👎 no",
  "text": "Where do I start the set smells like a old lady thats 80 it doesn't last but maybe a couple of seconds the sent is gone total waste",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHOOWFU7LPV27GUC52IJWSKQE6VQ",
  "timestamp": 1632703680783,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It’s alright",
  "text": "It smells nice. But didn’t notice an increase in attention 🤷🏼‍♀️",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF73LKLSVU2LHZRZEUHTANAJVYRQ",
  "timestamp": 1603927326532,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "One Of My Go To Scents",
  "text": "I have used this product for years on and off. I can’t say that I have any amazing stories like those I’ve red where I put it on and 5 minutes later my husband was humping me like a jack rabbit but I have started to notice since wearing it more our sex life has increased quite a bit. Not sure if it is the pheromones or the fact it’s winter and there isn’t much else to do lol. I have a friend who has also used this in the past and she swears by it. She claims she and her husband both go wild whenever they smell it.<br /><br /> I can tell you however that I enjoy the smell very much when I wear it as it has a nice floral scent without being to over powerful. It’s subtle enough to wear with my other perfume but nice enough to wear as a standalone.<br /><br />I used to have a kit I bought that had the roller, the blue bottle with the wand and a little tin pot with a solid perfume in it but I wasn’t able to find the kit or the tin anymore when I was looking to replace my roller. I like that the roller one is small so I opted for that over the blue wand bottle this time. I actually looked in quite a few places and it doesn’t appear they make the solid perfume in the tin anymore.<br /><br />Overall I recommend to anyone looking for something new to try. The price is worth it and it is quite enjoyable.",
  "images": [
    {
      "small_image_url": "https://m.media-amazon.com/images/I/61Yhu72ZBbL._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/61Yhu72ZBbL._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/61Yhu72ZBbL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    },
    {
      "small_image_url": "https://m.media-amazon.com/images/I/61rVccXHG1L._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/61rVccXHG1L._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/61rVccXHG1L._SL1600_.jpg",
      "attachment_type": "IMAGE"
    },
    {
      "small_image_url": "https://m.media-amazon.com/images/I/61w0XILGj4L._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/61w0XILGj4L._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/61w0XILGj4L._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFMGZGNZMF25JZMAMQDJPJKI5HKQ",
  "timestamp": 1646777992898,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Long Lasting Scent",
  "text": "I got this to see if it would flustered my partner and it does. I tested its durability by wearing a small amount on my wrist while I worked live freight. It does stay on for a while! However it can be a hit or miss for some because some friends said they couldn't smell anything.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHEOSB5U7WOJFZYSWF6LDBCSNIRQ",
  "timestamp": 1660420027955,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "I would probably return this if I was less lazy",
  "text": "Im trying to love the scent but it kind of makes me nauseous. The scent wears off quickly as well. I asked my husband to sniff it on my wrist and he couldn't smell it at all",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGYVOMCCUTU6NZIB64KPBDIUJ7CQ",
  "timestamp": 1658808431530,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Might be my new go-to",
  "text": "So far I'm loving the smell when applied on. Still testing it out and see if this pheromone oil is the real deal. However, I tried it on for the first time and was around my man and he definitely noticed. Let's just say he couldn't stay away from me last night.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFERPXQWQG5T5R5KQDQ7QL4GU4WA",
  "timestamp": 1638812064736,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 2,
  "title": "Two Stars",
  "text": "Smells good/fruity but it gives me a headache from the odor and no evidence of attraction from  opposite sex",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE4C5L2E45IQZN2V5M5ELO63WVUA",
  "timestamp": 1436506679000,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "IT WORKS",
  "text": "This stuff totally works. I wore it to a convention and EVERYONE was soooo nice to me (it doesn’t necessarily just attract men, it makes people just be nicer to you in general and also makes animals like you more for some reason). Also, this guy I like wasn’t making any moves on me, so I wore it when I hung out with him at his place and boom he made a move. I noticed him smelling me a lot and told me I smelled really good. Works like a charm!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFK7GU7WKAG6PMAU5TFOC3TATI5A",
  "timestamp": 1664778792381,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "This has no effect",
  "text": "I was really really excited for this product but it had no effect at all. For the price, the bottle is very small.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHYQ6TDVDR5HFWTQAAEKNOQYLCXQ",
  "timestamp": 1658185722992,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Smells Good But That's All",
  "text": "Ok I had to try it after all the hype. It smells good, slightly fruity but sexy....not like you're rolling on fruit punch. It dries slightly floral on me.  It doesn't last long at all, but that's ok I don't mind reapplying. But I have not noticed any sort of pheromone activity in the month I've been using it lol",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFMVFVIUZ7BKJRRKPAPMOAJJ37XA",
  "timestamp": 1661555038142,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Nothing more than a psychological confidence boost",
  "text": "I’ve bought this product a few times since I worked at a place that sold it. I saw people posting about it on tik tok recently and LET ME TELL YALL. It doesn’t work. It smells great for about 10 mins especially when mixed with a nice perfume or if you have a aromatherapy locket. IF ANYTHING people will just be nicer to you or cuddle up with you because YOU SMELL GOOD. Also if you can find it locally it is way cheaper. :)",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH73P6SSSAQ7POJOJ4R2JMN5LMJQ",
  "timestamp": 1610649393694,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "It’s ok",
  "text": "Saw this on TikTok and wanted to try it out. It came already leaking so I moved it to another container. It’s not worth the hype to me. The scent doesn’t stay on that long to me and it’s just an ok scent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFB2DSQA2HG7NBI5NQ6ZYHWKDW3Q",
  "timestamp": 1642404040678,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells so good!",
  "text": "LOVED IT! Love the way this smells!! My god! You'll love it! Lasts so long!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGXUTOAETTU6WOILD36L6NEUU42A",
  "timestamp": 1656215573200,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Four Stars",
  "text": "Love the scent, however it disappears very quickly, as in minutes.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEMN4KAQILOUOVC6V73QKKJLDAOQ",
  "timestamp": 1411854800000,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 2,
  "title": "No",
  "text": "I can't say that I'm pleased with this.<br />The bottle was probably the highest quality component. There is a list of ingredients, which is a plus...but there are quite a few synthetic ingredients, huge negative.<br />The scent(which I would not recommend for MEN, even though this says unisex) is more fruity and fades off very quickly. Which makes it necessary to keep re applying, and with the chemical content, I am not very happy about.<br />Unknown whether or not this does anything in the way of pheromone activity..but I don't enjoy smelling like a fruit all day to find out either.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEO2DDQUSNSHXZ3ONYQS5WS4RUTQ",
  "timestamp": 1487466519000,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Eh..",
  "text": "It's okay.. but wears off quickly. Will not purchase again.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEQQPNWP745YGJ53LRUACKMOECIQ",
  "timestamp": 1613616495463,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells great!",
  "text": "It is small but it would take forever to use the whole bottle! It is actually oil and not a perfume ( I didn’t read thoroughly but that doesn’t bother me) It says on for a while and it’s not greasy. Personally it smells like something you’d find at bath and body works but it’s not too strong. I would say it smells like a girls scent and not a guys.",
  "images": [
    {
      "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71JFd49qoXL._SL256_.jpg",
      "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71JFd49qoXL._SL800_.jpg",
      "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71JFd49qoXL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE2OCELUJLDWK26LVDL4J7FS5EUQ",
  "timestamp": 1603135733497,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "False claims",
  "text": "Didn't see any change in my husband's attraction to me, false claims... don't get me wrong I get hit on all the time and the perfume had a pleasant smell but I didn't have anything out of the ordinary happen and I tried it out for a little over a week.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGYSREK4XLZHL2HTUOYIVNMMJGZQ",
  "timestamp": 1657908121789,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Definitely works 😂",
  "text": "I have the spray but it's sold out so I got this and I swear this stuff gets me more tips. I'm a bar tender and I put a little dab on the sides of neck and my wrists before my shifts most nights. I have certainly noticed how my husband responds when I wear it but it wasn't until I sat down and did a budget this month that I realized HOW this stuff really effects my day to day interactions. I have made $50-70 MORE a night in tips since wearing it. If you're still on the fence about ordering this, just do yourself the favor and order some!<br />It has a pretty scent, almost sweet maybe floral (not great with scents honestly) but the scent is not overpowering. It rolls on well, no need to roll it a bunch to get the oil out. The product itself is good sized.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFG2XY4LHYI6N2MPN7VJXXCOYQUQ",
  "timestamp": 1626410246467,
  "helpful_vote": 7,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Better results with bacon grease",
  "text": "The husband is always very...eager, but I thought it would be fun to make him more so. Unfortunately, it has no effect on him, or it does and I just can't tell the difference from his usual harassment. I haven't worn it out because going out involves pants and I recently promoted myself to customer at work so I doubt I'll get to see if it works on anyone else. It smells nice though, but the smell doesn't last long.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG5TR47RFC7HXB3LRVIUPEFY2ZUA",
  "timestamp": 1603207618551,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Save Your M$ney..",
  "text": "With all the TTok videos circulating I decided to give this product a try. Once I received it, straight out the packaging I noticed that the oil was a thin/watery consistency not on the thicker side as I had imagined, I immediately applied it to my inner wrist and bend of my elbow. it smelled light, fresh and pleasant. HOWEVA!!! (rolling my eyes) the smell literally faded with 20 minutes or less, NO LIE!! I was like WTH? as any body oil wearer knows body oils usually last a relatively extended period of time NOT THIS ONE!! there wasn't even a faint lingering of a smell. I'm assuming that with all the interest and demand maybe the consistency got watered down or thinned out a bit to keep up with demand. It's not thick as the earlier reviews described when it was first recommended nor does the smell linger as stated. My recommendation to the manufacturer, JUST DO IT RIGHT, DONT SACRIFICE THE INTERGRITY OF THE PRODUCT TO MEET DEMAND.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE5TDVC5V37WOH67C6EVMWFVELRQ",
  "timestamp": 1609729329549,
  "helpful_vote": 114,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Spoiler alert...It's raining men up in here",
  "text": "It's my friend's birthday so I wanted to buy her something special and also something that makes her smell better. I thought about getting her a birthday card too but decided against it. Then I was like, why not?? so I bought her a card after all.  I'm insecure about the card choice but feeling very confident about this \"scent\" for her. I saw some people ask if this was for men AND for women... If you're a man and you want other men crawling all over you, be my guest lol!<br /><br /> When I was reading the other reviews many women mentioned that their man couldn't get enough of this \"scent\", so I knew it would be perfect for my friend who hasn't had any sexual intercourse (she's had intercourse, just not sexual), in at least three days.<br /><br />Fast forward to the \"giving\" of the \"gift\" lol.  Is that funny, or is it just me?<br />At first she was totally offended and was like, ill paraphrase \"what...the...dot...doggity dog?! are you trying to tell me something?\" I ignored her because I was nervous so I just kept eating my nachos.  When I had built up the courage, I said to her \"I got you a card. A birthday card.\" I was still nervous, obviously. I think she knew I meant birthday card when I said 'card' the first time. On second thought, she DEFINITELY knew. But she played along like a sly little minx lol. My impression was that she liked the card but some people thought otherwise (its my word vs theirs at this point). One of the better cards I've written for sure.  Reluctantly, she put on the \"scent\" because her mom taught her (through violence) to always be polite upon receiving a gift, especially if it's given to you by a man.<br /><br />WHAT HAPPENED NEXT WILL BLOW YOUR MIND. SERIOUSLY.<br /><br />It turns out she DID like my card. I have it on good authority. She didn't LOVE it but she definitely liked it. Rumor has it, she read it twice. TWICE! I should not have doubted myself.<br /><br />Anyways, turns out the \"scent\" really works. She's had sexual intercourse every single day since then and it's been like 6 weeks. Not always with the same partner. She doesn't believe in monogamy, but there's one guy I think she likes and I bet she'd be down to boo up if he asked her to. She'd probably deny it, that clever witch.<br />How do I know how often she has sexual intercourse? she tells me. Could she be lying? Of course. Don't think I haven't thought about that. But I know her, she wouldn't lie about this.  Would she lie about liking a birthday card? Sure (but also unlikely).  Her weight? Absolutely.  Being a raw vegan? I saw that sly minx clever witch at taco bell--and I don't think she was there for the scenery, if you know what I mean ;). I think she was eating there but she looks pretty generic so it could have been somebody else.  But still. Would she lie to me about how often she has sexual intercourse? No way. Full stop. Period.<br /><br />Five stars*****",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGD7Q2FF7KW6N333L33LRF3UVP2A",
  "timestamp": 1541817824657,
  "helpful_vote": 3025,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Don’t bother it’s cheap and doesn’t have a scent",
  "text": "Doesn’t have scent at all and not worth it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH6QMC3RXJHZVJWMXP5CSR6EJ3QQ",
  "timestamp": 1659066042307,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love the scent",
  "text": "The scent lasts for a while and is faint and light.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHOIW6PPD42HWT7J3I5TSFZJS7RQ",
  "timestamp": 1659926285104,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "No",
  "text": "You put it on, and then the scent disappears. Not after an hr or a few minutes. It goes away right away. A literal waste of money.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF3HUX64N3JPNX7Y7LALLWOJJIMA",
  "timestamp": 1630252176891,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells amazing!",
  "text": "I love the smell on my skin. I was not expecting to be oily, but that does not interfere on anything. I loved it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AESOIO2SUR7K4GXJT32SCGOYN5FA",
  "timestamp": 1663164936294,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It was alright…",
  "text": "So I’ve had my eye on this product for a while and forgot about it, but you know how Tiktok does.. So I purchased this and I’ve never had any sort of pheromone product so I wouldn’t say my hopes were super high but I was kinda hoping for some sort of reaction, it’s not like anyone was tryna take me into a broom closet or anything. As far as having any sort of effect on another person nothings happened YET not even a “you smell good, what are you wearing?” . But I’ll keep trying cause obviously I’m not gonna waste my money by not using it sometimes I even pair it with other perfumes just to see. My first impression of the smell was an apple jolly rancher then it transitioned to car air freshener lol but eventually it dissipated into a super light scent that I can’t really explain but still pleasant. And since roll-on’s seem to last for a while I don’t think I’ll be this again anytime soon.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEUB3J4L656G44EWMNM2QXU3ZP7Q",
  "timestamp": 1639245116957,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Might smell nice for other people, but I can't stand the smell",
  "text": "I was excited to try it out, it rolled on smoothly and wasn't too thick. I just can't get past the smell. My face scrunches up automatically every time I smell it. Un-useable for me. It's almost suffocating, musky even.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGV2YSKSOUO32AGFNIIAY7XIDLGA",
  "timestamp": 1616693035162,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Got him!!",
  "text": "Put it on my neck on the first date… two months later he’s talking about marriage! Thanks 😉🤫",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH54CQGAHWILIKKHMNXR43IKXKOA",
  "timestamp": 1654659008626,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "This product is magical",
  "text": "I love this product. There is barely a smell which I think is good, and I did notice more people seeming to want to talk to me. Maybe it was a placebo, but I still feel like there truly was a difference!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEL46WGMQTSTQWN37D6XQXKZAZDA",
  "timestamp": 1628962896531,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells amazing",
  "text": "Smells amazing! I like it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGRBZPP7AA4QGAL44CQJOTF5ILLA",
  "timestamp": 1608577831776,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "The Smell !!",
  "text": "Smell is amazing",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFCCWOLK6M6GH5Z73KREUQ5X55RA",
  "timestamp": 1608412749925,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "At least it smell good",
  "text": "Like everyone else I got this because of TikTok. It really didn’t work as they say but at least it smell nice. Most people probably wouldn’t like the smell.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AETAJVURPESAVCVSPO5G3GTY7PBA",
  "timestamp": 1649431481885,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Chefs kiss",
  "text": "It’s smells divine!! I couldn’t stop smelling my wrist. I gave it 4 stars only because I wish the scent was just a bit more potent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHB3WOXZL2KHNFXLVPT7WCWECIFA",
  "timestamp": 1636598832522,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Buy it, dont wait, buy it now.",
  "text": "Okay so this was a long shot purchase, I wanted to see if it really worked and man was I blown away. I bought this and as soon as it arrived I applied it to my wrists and neck and the scent smells amazing not overbearing.  I wanted to see if my husband would notice, at first no result. After applying ot a few times a day and 3 days later I noticed my husband was getting more flirty and more handsy and lovey. This product works and works amazingly.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFVBWWJ4YZMRWBQCHPESWHZXL6JA",
  "timestamp": 1586210610372,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it.",
  "text": "Has an amazing smell. Don’t need too much and it definitely does what’s it supposed to. Will definitely buy again and recommend.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE7VPNVQEM44RADOWNPJ25FODS4A",
  "timestamp": 1676407663827,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 3,
  "title": "This ain’t no magic love potion",
  "text": "So we are all here because of tiktok...<br />Tbh, it did nothing lol<br />There’s no “omg you smell so good I’m crazy for you” type of thing like ppl mentioned on tiktok or even the reviews here on Amazon.<br />It is just a perfume roller and honestly the scent isn’t bad but it’s not gonna drive anyone crazy~",
  "images": [
    {
      "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81EkbEy1VBL._SL256_.jpg",
      "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81EkbEy1VBL._SL800_.jpg",
      "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81EkbEy1VBL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE3C4AQU6QSRB5XL7COQOLLNYGXQ",
  "timestamp": 1606040626567,
  "helpful_vote": 57,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Do not waste your money",
  "text": "This product smells horrible. My husband definitely noticed when I had it on. The smell reminds me of my nanny when I was a kid, for myself and my husband, the stinch of a 70 year old grandma is not attractive! Lol",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGXALOMTSDLNZTBW4II2MNCWFV2Q",
  "timestamp": 1667522674644,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love",
  "text": "I love this perfume! I will order again. Don't expect people to be falling all over you when you wear it. Obviously.<br /><br />But I have noticed that people are nicer to me when I wear it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHAJBSATT65PUMDSDJOHXONBT32Q",
  "timestamp": 1614157367776,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Smell can depend what soap you use",
  "text": "Sometimes it smells nice and sometimes it smells worse depending on the scent of the body wash I used to shower prior to applying this pheromone.<br />And one issue is even though I take showers daily somehow some particles from my body got stuck inside and mixed into the oil and basically impossible to clean to like when it was brand new. This doesn't seem to affect the scent but it lowers my confidence knowing that my body is dirty an contaminated the oil. Maybe I put it in the wrong spot as I mainly use this on my arm pits but it didn't come with any instructions on how to use.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG5RGMA3UNN7YJJU7TWMWENNL5KA",
  "timestamp": 1648349793731,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Smells great but doesn’t last",
  "text": "The smell is great but it doesn’t last, and had no other affects then usual on my dude",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHOFG6FZKNPLXMSXZAPCCKKSPS3A",
  "timestamp": 1662144946527,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Don’t waste your money.",
  "text": "Doesn’t work. I wore it around my boyfriend and it did nothing. I also wore it to work and nobody said anything. These reviews are probably just over dramatic.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGXSCPZECKH5YYJBEEDJMF5EHPXA",
  "timestamp": 1613875379310,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Not work",
  "text": "Didn’t seem to have an effect",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE4ZIWXQ6MD2SGIJM2XYT3NMABHQ",
  "timestamp": 1617410266853,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Smells good",
  "text": "Smells great but fades after a while 🤷🏾‍♀️",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEJYXNQERZCPFGFPZSVQ7BKVN7LQ",
  "timestamp": 1673236528043,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Not for this hippie",
  "text": "I'm all about the pheromones and natural scents, I'm hippie as they come (don't get me wrong, I understand what good hygiene is lol). I've been told I naturally put off a very distinguished scent, but men and women alike. In a good way. So I thought this would only enhance the mystery...I haven't noticed a lick of difference in any attention, or anyone saying anything, and I can not smell it myself either. Idk...decide for yourself.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF2RZ7KZO5DNIWD6LGA77GRIODVA",
  "timestamp": 1663617237965,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "save your money",
  "text": "no smell, no work, not sure what it really is",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEDDOPB4SSBJVNI7RVUT5NBWF3KQ",
  "timestamp": 1654367077832,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "nope for ne",
  "text": "BAD",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGUBBJLWVWUXZ4OULEEQ22QIZ7CQ",
  "timestamp": 1616517383559,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Nothing.",
  "text": "I really wanted to see “ something “ but unfortunately it just seems as if after a week I’ve added another strange floral twist to my already expensive designer fragrance…. and it did not one single thing as far as I can tell. I’ve gotten better results adding Jovan musk oil to my after shower lotion.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEVRL2YNA2WMPU4JATG5YEPDDPLA",
  "timestamp": 1658317719935,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Loved it",
  "text": "OK so at first I was having trouble finding my disearnable scent, and I tried wearing it as a test trial just to see and my nose could never tell. It would smell exactly like it did from the bottle but my body chemicals would make the smell super strong and overbearing(not a bad thing). But I went on vacation recently to visit my hubby and he was super all over me. And then when I didn't wear it he was still grabbing on me but not as much so I can definitely tell it works. But he said I smelled like sweet lemons. So now I know that I can live in peace I smell like lemonade🥰",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF6P3NJUG2CWVKSRKB735M5QTV6Q",
  "timestamp": 1676938347006,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It works for me.....",
  "text": "The smell of this is awesome- it srsly gets me all hot and bothered and im the one wearing it lol- so i was excited to test it out. I have been using it for about 3 weeks - i work as a server and in this 3 weeks i have made better tips than usual, have had more easy/friendly interactions with customers and i believe it also helped me to charm & diffuse a situation with a difficult customer.<br /><br /> But by far the best part was the first week i was wearing it each of my bosses (a male and a female) on different shifts randomly just handed me $20 out of nowhere bc i “was working hard”.... now let me tell you- i have been busting my butt at this establishment for 8 years and my bosses have never just handed me cash out of their pocket like that - so yup i would say this stuff works pretty well :)<br /><br />The only negative is that a lot of dogs and cats also get really friendly/obsessed w me when im wearing this. Not exactly what i was going for.... but its a small price to pay for the rewards i have been reaping. After nearly a year making no tips due to the pandemic, i was looking for a little help and i found it! I will definitely be repurchasing this!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEG2WVAHU2LP7ETQBD7NYTII54EA",
  "timestamp": 1623428250076,
  "helpful_vote": 3,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Doesn’t work",
  "text": "I don’t get the hype over this. It smells like sweet candy and the scent does not last!! The scent is not strong at all! I guess it’s ok if you’re going out for an hour but that’s as long as it’s gonna last on you. It’s just ok. My boyfriend barely noticed..",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFVVACISHUOG6KKJK4NZJJ5ETOGQ",
  "timestamp": 1635880496401,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Worth the money and works!",
  "text": "Everyone has a different sense of smell but for me I love the way this smells! When I have it on I get a lot of complements on the way I smell and my boyfriend loves the way it smells!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEKG2JYPAKT2OVI3DIB4VVJ2D6EQ",
  "timestamp": 1608652020105,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "I just received this in the mail.",
  "text": "I was very afraid because of other reviews mentioning it smelt like cat pee or had a horrible smell, for me, ABSOLUTELY NOT. It has a nice light floral fresh scent. It’s very clean, I like smelling it on myself. I haven’t tested it out on a man yet but I will update when I do.",
  "images": [
    {
      "small_image_url": "https://m.media-amazon.com/images/I/61LLYG4x+pL._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/61LLYG4x+pL._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/61LLYG4x+pL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFJCVOUIB7OBG3FGNV5USDVAYIZA",
  "timestamp": 1639957719619,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Grandma Scent",
  "text": "Smells like an 80yr woman on her way to play bingo. Longevity was great. Took repeated washings and scrubbing to get the extremely floral scent off.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEFGFJ24I6QXWIBK5ELMYXNRUKEQ",
  "timestamp": 1673250947662,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 3,
  "title": "NOT for gay men",
  "text": "It smells exactly like my mother (powdery, but fresh old lady smell) so it doesn’t work if you’re a gay man trying to attract men.  I tested it and I did notice more women checking me out hence I am still giving it 3 stars. However, I’ve bought pheromones years ago specifically for gay men and it worked —I attracted both straight and gay men and so I returned this to order and looking for that product again.  So this product is good for heterosexual men if you want to attract women BUT you will smell like my mother LOL",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF3L3T7BVCHIOJV32HJNLSFG3ASQ",
  "timestamp": 1655305685150,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Idk why y’all lying in the comments!",
  "text": "This doesn’t smell good not even a little bit! Y’all all lying in the comments, I would never wear this around my man! I have body sprays that smell way better than this crap! What a waste of money! 🤢😷",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFM47IRBHV7PFRHNDNIWE7Y5AHOQ",
  "timestamp": 1656723098064,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Wow!",
  "text": "Smells super good and bf said he had wet dreams all night😂 he didn’t even know I had put it on before bed lmao!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFLNHEKLXUN6SY4NXZIZWRSJM66A",
  "timestamp": 1639744929322,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I think it works",
  "text": "It’s a light peachy smell. I like it and I only had this on with some body spray and this guy told me I smelled so good, we were talking all night. I’m sure it was the perfume coupled with many factors but so far so good.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHLXRDDBWTIMPV3VXNTBZYENDXXA",
  "timestamp": 1676300186493,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Smells Good",
  "text": "Love the smell but does nothing for my husband.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHOM7OF53DX5J3F7RIOGRM3NK7HQ",
  "timestamp": 1625671632269,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Works and smells great",
  "text": "I got a guys number the first day I wore it!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AELFNAVHIEDS7FB4WZSLOKUMRDRA",
  "timestamp": 1637815181320,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "OMGGGG YALLLL THIS IS THE TRUTH!!",
  "text": "I ordered this oil and it came yesterday, let me tell yall this first of all it semlls soooooo good my 2 year old kept saying umm mommy smell good, my 17 year old asked what it was and my man smelled me and kept saying what is this I like it and he turned into a sex maniac within 10 minutes. We hadn't had sex in a month but last night we did 2 rounds and he wanted more but I had to got to bed so I could get up for work  but I'm putting on some more after I shower tonight because this oil made him put it down",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF5QECB4HQ3XL37F3OTP7FWVKWGA",
  "timestamp": 1651694830616,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Not a fan",
  "text": "Personally didn’t work for me. It smells really weird my boyfriend even asked what perfume I had on cause it smelled really strange",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEA2ZPJIRCZSM6A5VAP5JVI4CLSQ",
  "timestamp": 1610942938193,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Exactly like pure romance",
  "text": "I love this perfume so much. People definitely notice it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF3YF3Y6ZWSYAXCWHMEVJWRGPP7Q",
  "timestamp": 1655065822799,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "4.5*",
  "text": "Great purchase!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGVHYFRAK3WDPLGXN73S3GHIX7CA",
  "timestamp": 1671479155718,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 1,
  "title": "no  action here!!!",
  "text": "i bought this based on the reviews that it was given ,i am very sorry to say  the only thing with this is that it has a nice scent , i put it on at night before goin to bed , nothing  extra there,i wear it out otherwise nothing, i ent attract man, woman nor flies .",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFPJT6AA5BYPEWKLL4WWIESKJWRQ",
  "timestamp": 1611845883182,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Great scent",
  "text": "I love this scent. I get a lot of wanted and unwanted attention. So I guess I can say it works for me.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF2E3DG2XALDJE4MDYOSMTZRQWKQ",
  "timestamp": 1620005329537,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Another overhyped item",
  "text": "Another waste TikTok made me to buy",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFY2DSMXYRM6WITRVFN36STT5ZTQ",
  "timestamp": 1641147722340,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Ehhhh it's a scam",
  "text": "The smell is a little odd and I didn't notice any additional attention from my partner. If you ask me, you should just forego deodorant for a bit and let your natural pheromones come through. It's cheaper and won't smell so... chemically? tbh I think most people's natural body smell are better than this.<br /><br />Maybe find a scent that plays well with your natural body chemistry instead of adding this weird smelling thing into the mix? I just felt the need to add other perfumes to mask the sour smell of this.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE6OWZZU4CWEFIQECC6KL4PL36QQ",
  "timestamp": 1657824509039,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Smells amazing.",
  "text": "I’m not really sure it had any impact on my boyfriend but it definitely smells really really good and I was drawn to it myself. Smells like raspberries",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AET4P4MTE4UD3D33IB35YGDW552A",
  "timestamp": 1624221401495,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I like it",
  "text": "It smells different immediately than it does after about 20 minutes, smells better after a while to me, seemed oily when put on but once you rub it in it doesnt leave an oily residue.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AELKQKFWLWI2GEGGRFWGUA26HZGA",
  "timestamp": 1611456200173,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "If you like smelling like a toilet bowl in a Public restroom this is for you",
  "text": "This perfume smelled horrible As soon as I took the Off I definitely came back to Amazon to start a return if you like smell like the sanitizer in a public restroom then this perfume is just for you! Definitely has a sanitizing sort of Scent I don’t know who am I right mind would be attracted to this but it was a complete turn off for me…",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGJRXSINCHQGNH7J4ZJ6PV7LPTNQ",
  "timestamp": 1643576148761,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Nice",
  "text": "I bought this obviously because of tik tok lol. I’m gonna be completely honest with y’all, I’m not sure if it has any effect but every time I wear it and then put my perfume on top of it, I seem to get more attention than I usually do. Plus, in all honesty the oil smells really nice on its own! I like it even without the whole sex appeal factor of it haha. In my opinion this oil helps your perfume last longer, and it doesn’t change the notes in your perfume, it in fact blends in seamlessly.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGOBAP5DJUIYG5S6IAVPFIUON2TQ",
  "timestamp": 1664399933658,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Is it just a placebo effect",
  "text": "I bought this product after seeing it on TikTok with users comparing it to a “love potion.” After using this for a few months, I’ve decided to reflect upon any changes in others’ “interest” in me. As far as I’ve noticed, my relationships with others have been relatively the same. I’m not sure if others were just experiencing a placebo effect or not.<br /><br />As for the actual smell, I would describe it as artificial grape. Not my go to scent but I thought I would stick through it if it meant I could woo others. Little has changed so I think I’m done with the scent.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFELREEUX4P7ISVNN6TLHHEIQNOQ",
  "timestamp": 1638237944129,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It works. TL;DR at the bottom.",
  "text": "Alright, so it looks like my scent glands are perfect for this product because I smell like a musky jolly rancher. It’s subtle but it smells great.<br /><br />My husband has been struggling with his body in the bedroom so I bought this to help things along. It works. Let me tell you how.<br /><br />I had this delivered maybe twenty minutes ago. He’s working from home, so he’s distracted and his head is full, you know how it is. I applied the stuff.<br /><br />When I entered the office, he was walking back to his desk, but he stopped and came over. He kissed me very tenderly and sweetly for longer than he probably should have, with all his chats. He was smiling and his eyes were all cloudy - I had to push him off to get him going. Now he’s chatting with me, keeps getting distracted and is giving me these particular smiles. So. I’d say it works, especially because his anxiety has been getting in the way of even the small things like that. He’s definitely not thinking straight. 😉<br /><br />I should mention that he doesn’t know I’m wearing it and doesn’t even know I bought it, so no placebo going on.<br /><br />Of course it’s not like I’ve had this for long, obviously. If I remember to update, I will!<br /><br />I’d like to comment on human pheromones, so this part is technically no longer review if you don’t want to read it. I do explain my reasoning for recommending the product if that interests you.<br /><br />The science of human pheromones is a funky one because not every person can detect them. It used to be, at least it’s believed, that pheromones factored in much more in ancient times. Over the years we’ve evolved not to need it so much.<br /><br />Now, some people still maintain the ability to scent others. Personally, I’m one of them. My sense of smell and perception of others is pretty darn strong. My husband has it too, though his actual sense of smell is less. In fact, it could be that you yourself can’t pick up others at all. And that’s fine! You’ve just evolved out of it.<br /><br />Now, some people cry snake oil on these products for that very reason and for some of them, I’d agree, because it’s best to purchase pheromones that match with your natural body chemistry. If you’re born female, use products with copulin and other intrinsically female pheromones. Vicey versy for the men out there.<br /><br />For transgender people, I’d like to assure you that it’s not going to make you seem more like your sex at birth. Pheromones don’t work that way, so if you’re nervous about it, don’t be.<br /><br />It’s a science and a dicey one, but hey, it’s worth a shot if you have a little extra cash and not enough attention. Don’t over apply. You’re enhancing your natural scent, not replacing it.<br /><br />TL;DR: Works for me, might not work for you because science. Less is more. Apply to one wrist, rub on neck and other wrist. Be gentle or you’ll break up the scent. Do your homework.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGH2H7KUDBFLGG7IRURASTJEGDLQ",
  "timestamp": 1643464822000,
  "helpful_vote": 40,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Good value for price",
  "text": "Will never not use this as a layering scent! So good and lasts for hours",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFI4Y76PIZC3GNTY4GGS3BYZ5UQQ",
  "timestamp": 1656825691740,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It’s ok",
  "text": "The scent is ok but I’m not seeing anymore attention from men than I usually have.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFCFS5VYFADJ27FEOVVXU4IXFCVQ",
  "timestamp": 1624187121254,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It’s okay",
  "text": "Smells ok nothing crazy. Haven’t gotten any crazy compliments or anything and it does not agree with my skin and makes me super itchy so I can’t really wear it..",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGLFKQHJL5NVKTBXMTSFX2JJGARQ",
  "timestamp": 1625945696134,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Just fragrance",
  "text": "It smells nice but that’s it. There’s been no difference regarding attraction. Been married awhile, all is well but this did nothing. Don’t waste your money.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFY2VFLO5SHE6GHHF2O6ZG2HJPXQ",
  "timestamp": 1669922042806,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Not the worst, not the best",
  "text": "Alright so I’ve seen this everywhere and I wanted to try it. When I put this on I smell hand soap but not the good kind. I had my sister smell it and she said it smelled like vodka lol. I had my dad smell it and he said it smelled like flowers. I’m not sure what to conclude from all that but I personally don’t like the smell. It doesn’t last long either so you’re going to have to reapply after and hour or 2. I’m going to try mixing it with my favorite perfume and see if that helps out.",
  "images": [
    {
      "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/91Ok4XE3VQL._SL256_.jpg",
      "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/91Ok4XE3VQL._SL800_.jpg",
      "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/91Ok4XE3VQL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGUWOJLL6NTMCUCVFXSEHNFNSFKA",
  "timestamp": 1617503763711,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "no one seems to notice but me, but that's okay",
  "text": "even if it doesn't work exactly as advertised, it does smell nice. i tend to be picky with perfumes, and frankly i kind of like that it doesn't stay strong for very long. it settles into a nice, subtle floral smell that doesn't smell like old soap the way a lot of perfumes do. my only gripe is that if you put it on your shirt it leaves a little zig-zag of oil, but i think it was designed to go directly onto skin anyway. i have very sensitive skin and this doesn't irritate it, too.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGHZRPWYEYYDF444JW57JC5ME5BA",
  "timestamp": 1654719345584,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Sad",
  "text": "I bought this based on reviews and it legitimately stinks on me 😞 I’m so sad. It lasted only about 10 minutes and for the 10 minutes I could smell it, I did NOT like how it smelled. Waste of money.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFK4ROSI3D2KDRDU3END6NAV6DUQ",
  "timestamp": 1659212371807,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells like candy!",
  "text": "I haven't actually tested it out on my boyfriend because he lives 2000 miles away, but this smells amazing!! I put on a tiny amount and it's so fragrant. Definitely worth it for the money",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHAG54SF3KVVXXXNLIBZ4MADI3EQ",
  "timestamp": 1631811473155,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "I LOVE the smell it creates on me but…",
  "text": "I love the smell personally, the intended purpose did not work out. He literally doesn’t even notice it and has no effect on him.<br />Maybe I just need a new man lol",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGY6FQWF2BCM2X4XXK55CA6KS4EQ",
  "timestamp": 1636999056465,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Not one compliment",
  "text": "I’ve been wearing this everyday for months and there has been zero difference. I haven’t even been complimented on my smell. My lotion gets more attention than this :(",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGQCI5IJYPEL3ERMMCO5TRXIXRRA",
  "timestamp": 1635252298739,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Doesn’t work the way I thought it would",
  "text": "It smells really good, almost like a watermelon lip smacker that you got as a little girl, but it didn’t work the way I thought it would. I read other comments that said that their boyfriends were on them like dogs lol and I bought this as a joke but it was a dud. The smell stays on your clothes but it doesn’t last on your skin.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFHZIL2ZRPRETTRS5DCQA4V2HDCQ",
  "timestamp": 1622473607821,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Meh",
  "text": "The scent is not one I like on myself but was willing to try it if it was one that created a response by men.<br /><br />I noticed no difference in response nor did anyone mention it. When I asked some of my male friends to rate or comment on fragrance, one said it was ok and the others couldn’t tell any difference.<br /><br />I did have a non pheromone perfume in my purse that I normally wore, and all preferred that one.<br /><br />So I’m going to say pass unless you actually personally enjoy the scent for yourself.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEJBUXNZK3YDCZA3Q5CNXUKPFNJA",
  "timestamp": 1672803785451,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Scent fades really fast",
  "text": "I really want to love this. The scent is really sweet and floral. It feels nice going on and I love how the smell combines with my skin, but 20 minutes after I apply it it’s gone. I would expect it to last longer for the price.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG7SX6IN5QVAM77HMLLXC6O7WWSQ",
  "timestamp": 1633314067998,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "If you want to smell like a old lady..",
  "text": "So gross! I’m not a floral person AT ALL and this was crazy gross! I waited two to three hours for the smell to fade and it didn’t. It smells like a old lady! Will be returning ASAP.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE3PD5XMWFJWEL55EWILKIFRTCVQ",
  "timestamp": 1625877978410,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "it’s okay",
  "text": "it was delivered leaking but it does smell amazing",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEMD4GOSONIYFMW76WSWLJPIHGBA",
  "timestamp": 1615252312029,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells amazing",
  "text": "I always get complemented",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH4SRYWA5OKWVIZSNIHYWGAVSIYA",
  "timestamp": 1607490821862,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Not what expected",
  "text": "The smell is a mix of “outside” and must and old-timey perfume. It’s odd. Supposedly it contains pheromones - haven’t seen any type of effect in that regard - at all. I tried to put a small amount at sternum area - terrible idea - gave me a rash for two days. Overall not very happy with it, but I didn’t know fully what to expect either.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFCHDKGY4OCYXRC7HUSODQOKIB6Q",
  "timestamp": 1662111888465,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Any difference when use it.",
  "text": "My boyfriend says doesn't smell bad, but is not an amazing smell.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEUPME6MVK33YHNXD3OKRD52T6WA",
  "timestamp": 1628961087150,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Waste of money",
  "text": "Not worth it doesn't work nor attack any men 😂",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH2Z3DU5XLTWEB2OKUBGXPKRHHDQ",
  "timestamp": 1662315167298,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Questionable Results",
  "text": "I purchased this product just before taking a trip to visit my boyfriend. I did wear it on a couple instances but I’m not sure I can say that it was effective. The results of a date night with the fragrance and the results of a date night without it seemed to be relatively one in the same. Nonetheless it has a lovely natural aroma. To me it was a prominently vanilla and citrus scent that reminisced of essential oils. It also lasted about as long as a cheap non alcoholic based perfume would, so I’d argue that it’s pretty fairly priced.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGJHKQZO2LMHW42R6NLUKN7EG6HA",
  "timestamp": 1659490606593,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Disappointing",
  "text": "First of all this stuff smells very flowery (kind of like an old lady perfume) I would not say it is unisex. I wouldn’t have minded it as much had it actually done what was advertised, but my husband didn’t even notice I was wearing it. Not even a “you smell nice” compliment. The only good thing I can say is that I like the size of the bottle and that it has a roller ball. That’s about it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH75F6VOPQHQZLTZZDX7D3XTZJTA",
  "timestamp": 1663359648760,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Different Strokes for Different Folks",
  "text": "I didn't think this would work because of all the negative reviews, but it did. It really does depend on the person.<br /><br />- Brought on more attention, affection, & nuzzling.<br />- The smell does change. I like the initial smell better than the final one. The scent lasts long (on my skin).",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH7Z7K5FTNKQV2HT563FLJKRTA4A",
  "timestamp": 1638196715855,
  "helpful_vote": 0,
  "verified_purchase": false
}
{
  "rating": 5,
  "title": "Great",
  "text": "Smells so good",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG7ZXLH37IJIVMV2KVL3F4EEIUMQ",
  "timestamp": 1651724305188,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "LET ME TELL YOU",
  "text": "This is the scent. This is the product.. This is what you've been looking for. Wanna love yourself more, wear this. Wanna get a man to think about you, wear this around him. Want your man to disrespect you respectfully...wear this. This scent has has me feeling myself and my man feeling me. Buy it. Just buy it. If all else fails, which it won't, this smells fantastic anyway. It's subtle and sweet. Last quite a while, probably unlike any man in the vicinity. Buy it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF5EGG4Z4EZSK47AMESGMLQEZKFA",
  "timestamp": 1631483484798,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It works!",
  "text": "I wasn't sure if it was going to work but I bought it and didn't tell my husband. As soon as I put it on he was super clingy. He was all over me like he was before we were married. When I asked him the next day why he was acting like that he just said he was super turned on by me and didn't know why. I ended up telling him that I bought it but he is still acting the same way and it smells really good. I also noticed guys looking at me at the store and starting conversations with me out of no where.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFIX4NNB4HFOPWJSVKEPADLAGIGA",
  "timestamp": 1655584933841,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "It’s Ok.",
  "text": "[[VIDEOID:bd2ab2a7b485d8d82a08dd64ba1f42d5]] It works, Especially when it’s freshly used.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHV7TZF2CP5BOW5IH2LTIL7NFI4Q",
  "timestamp": 1677159323535,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Might have worked",
  "text": "My bf loved this mixed with other scents",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH4F3VLDX5MR6NMXENBOE2TQ5SLQ",
  "timestamp": 1634833583461,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Peeee-yuck",
  "text": "Smells like someone tried to spray perfume inside a dirty truck stop bathroom with no ventilation.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEYSVIQAPAVKG7MSXJYN5NEPA2AA",
  "timestamp": 1665522691066,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "This stinks",
  "text": "The smell is a bit unappealing",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGUEFD46BNCAB2LXRJSKNKPDQK3Q",
  "timestamp": 1643745099480,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Doesnt work for everyone..for me it the opposite",
  "text": "I really wanted to love this stuff. Maybe for some people it works, or they like the smell, but that didn't happe for me. Actually it was quite the opposite...<br />-I received the bottle quickly and I ripped it open and dabbed it on as fast as I could. I immediately realized I only liked the smell of this stuff from a distance, and there was an odd smell hidden in between the pleasant ones. I can't describe it other than- ass?? I was like hmmm.. is that the pheromones? I didn't know what to expect I've since never worn pheromones. Luckily that scent actually fades out after a while and it smells generally good.<br /><br />-Next test: how would my partner react? He always compliments my smell and never has it went unnoticed when I wear a new scent. Gurl......  I spent almost an hour doing the absolute most to waft the scent towards him and see if he would notice without me saying anything. Nothing. When I finally did and he leaned in closer to smell it... his reaction was like \"oh cool.\" The worst response he's ever given me on any perfume.......<br /> We actually fought later that night. It was something unrelated and I can't blame that on the scent, but I do remember in the moment the fact I was wearing this did cross my mind.<br /><br />-Work: no customers complimented it or gave me more tips than usual. I started wearing my old perfume mixed with this one since it wears off quick as well and I just wanted to use this one up so I didn't waste my money. I showed my female coworker it and let her smell. She said \"hmm. Weird\" and didn't ask to use some like she has with any other perfume. She also agreed that there was a faint off putting smell if you smelled it too closely. I gave up and threw the bottle in my purse with no intention of using it again. I didn't put the lid on well so it then leaked out and dried up and i was honestly grateful it did. Yikes.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFRV6XRJUIGKD7BWPXFPWKNDLOWA",
  "timestamp": 1627598213786,
  "helpful_vote": 5,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Does not do what it says it will!",
  "text": "Product does not have the effects it claims to have.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGB2OAENDWYUIXSEAHFNZJF6ETPQ",
  "timestamp": 1679051739693,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Smells nice but is just perfume",
  "text": "Smelt like flowers but didn’t really notice a change in attention from men or my boyfriend",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AECS77KO3ZTBLJ2IK7YH24R6NYAQ",
  "timestamp": 1622689627941,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Smells lovely, but ..",
  "text": "It smells lovely, but I can't say it's lead to more .. primal rendezvous. Does require reapplication throughout the day/night.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH3ITXOVXBVBHEFSTABBGP5EDY3Q",
  "timestamp": 1649135395241,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Maybe I didn't put enough on",
  "text": "After reading all the great reviews I thought I'd try this. I've been wearing this about a week. The scent isn't to bad and doesn't last to long. Unfortunately it didn't work for me. I've worn it to work, to the grocery store, I even got desperate enough and wore it around my ex and nothing!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEKPD732DVRRPK6SBZFJDSK43TWA",
  "timestamp": 1650148141176,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Not for everyone",
  "text": "The smell coming from the roller is very pleasant. Although when applied to my body, my husband said I smelled like an older woman, my daughter said I needed to take a shower, and my son said he didn’t smell anything. Now, when applied to my husband, we all said he smelled like candy. Lesson learned that this product is not for everyone. 🤷‍♀️",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHQVZK7RZQIIOUFH2N3MMMTHBFBA",
  "timestamp": 1607601136319,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "It only works for some people",
  "text": "Personally I love the idea of this perfume. But it’s not going to catch someone’s attention if they are sitting next to you. It’s more of if the person is hugging you or is able to get close to smell it. So I don’t wanna say it doesn’t work but it’s overpriced. It smells fruity which I didn’t think it would",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFP5L3RRD4UOADJQEOUJXJECF4LA",
  "timestamp": 1665017934678,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Doesn’t work",
  "text": "Wore it for two weeks he never noticed I’d change scent or anything he tried it. it doesn’t smell great,  kinda like cat piss . I can understand why he never smelt or noticed it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AED6SECGBSTN2K3355QRUIJGG5GQ",
  "timestamp": 1640907582967,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Magnet For Men!",
  "text": "Not only do I love this scent and smell it sometimes just for a lil bit of happiness but everybody around me loves it!<br /><br />I always get compliments especially from guys, just randomly as I'm walking through Walmart and such.<br /><br />My boyfriend absolutely loves it and I've never seen him more cuddly! If you are okay with all this wild attraction and love from people around you I think this product is for you! Try it it'll blow your mind.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEIE2OCMXSNHZXTFC2KLCSNI7EJA",
  "timestamp": 1678336822149,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Not worth the money and didn’t smell like anything",
  "text": "It doesn’t smell like anything on me or my bf I had high expectations and it was not worth it😕<br />And what little smell it did have smelt like soap and went away within a few minutes",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFXWHG7N2C72ZKH6C2SZYTSIZASA",
  "timestamp": 1626541711730,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "nice scent",
  "text": "nice scent, havent gotten any compliments yet but more people than usual are being friendly to me",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG44TNPKN3KWX4CKJQCBOIT42O2A",
  "timestamp": 1633397724138,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "I saw the product on tiktok and I made the purchase out of curiosity. Total waste of money. 👎🏻",
  "text": "It does smell lip balm but still a total waste of money. 🤦🏼‍♀️",
  "images": [
    {
      "small_image_url": "https://m.media-amazon.com/images/I/B1l87hmSncS._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/B1l87hmSncS._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/B1l87hmSncS._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGIBJURHQKY23P7HLOC2IO4YKIFQ",
  "timestamp": 1628569315343,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Brings all the boys to the yard!!!!",
  "text": "I mixed this with another perfume I have and I had men following me to tell me how good it smelt!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFKO6FZZRW44FOK6Q4EMCI4IGLXQ",
  "timestamp": 1664123779129,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Worked",
  "text": "We hadn’t done the deed in over two weeks. I put this on and we did same night then the day after. I don’t know if it was a coincidence or not. But, I love the smell myself, so I would buy again.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGOG3SFYTAQ4GUPFIJQSRFGBEJ5Q",
  "timestamp": 1642606739523,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Way to sweet for my liking",
  "text": "the scent lasts forever, unfortunately for me because it was way too sweet it gave me a headache, however my husband that it smells nice",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH6JP2ZRLF4C5FGAEH6JBRJQGN3A",
  "timestamp": 1669810611899,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Smells like the soap in public bathroom",
  "text": "Smells like a mix between old lady soap smell and public bathroom soap smell? Its unisex but leans feminine to me. I don't know what I was expecting, the other reviews overhype it quite a bit. There's other pheromone colognes out there, I'll give those a try.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH4AWA4USJD7KHRO7L33ZF2QBJWA",
  "timestamp": 1648905032411,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "I like it",
  "text": "It’s smells very sweet to me like strawberries but I do believe it mixes with your body scent as well. Like any perfume … it’s no magic potion though . To give you an idea, it smells like “sexy night Victoria secret “",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AH6TEVIQWFYDZMXLANFYYBYL2QBA",
  "timestamp": 1645379969947,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Lol",
  "text": "Maybe my husband is just broken? Lol. I waited until I got home from work and showered before testing this perfume out. Straight out of the bottle it smells very citrusy and light, after a few minutes once applied the scent (for me) changed to a vanilla/flowery smell which I really like actually. My husband didn't notice whatsoever. I even hugged and kissed him and he was too worried about finding his screwdriver 😂😂😂 the dog did notice though, she's been following me around ever since I put it on.<br />Does it lure in men and make them want to give you babies? Nah probably not but it smells nice",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHWPUDDRPFKDADSFS5IMJ36VXOTQ",
  "timestamp": 1659996823381,
  "helpful_vote": 72,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "NOT WORTH IT!!!",
  "text": "Smells like swe@t or like som*one hasn't showered in a few weeks. Repellent for all g*nders and works great as bug Repellent. Not worth buying, it is definitely the worst smell out there. Everyone reviewing how well it works is 100% ly**g. I wouldn't even give it a single star if I could.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGRBQ5XEME7IPIGDHIIB4DALQNMA",
  "timestamp": 1629460937351,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "I'm not convinced it works",
  "text": "First off I have to say I thought I would try this after searching for a perfume. I was intrigued when I came across this pheromone while in my search. I am always on Amazon and I LOVE reading reviews on products before I buy. Hopefully this helps someone else.<br /><br />I have a high sex drive to begin with. My partner also has a healthy sex drive. We have a great relationship. This wasn't really needed but was super curious. I am all for him wanting to pounce on me 24/7 so if this little bottle can make him want me even more I'm ALL IN !<br />Yeah that didn't happen. If fact at first I was confused because I put this stuff on and he wasn't even paying attention to me at all. First couple days I started to question myself. We typically have sex no less than 3x a day and after putting this on it went to zero for a couple days. I really tested this stuff out. I'm still using it so I'll keep you posted if anything changes. We did have intercourse heavily while wearing this pheromone but drinks were involved so I don't feel that's a fair assessment.<br /><br />Overall I say this stuff doesn't work. The smell is nice. I really like it just as a fruity scent to wear. It doesn't last long at all. It's oil based so rubs off quickly on anything. I felt the first time I tried to seduce him with this pheromone I was applying it all over. I felt I nearly took a bath in it. I live in a humid place so I just kept sweating this stuff off. I was trying to get all pretty for my man while waiting for him to get home from work. Hoping he would smell me and want to pounce me like a untamed lion. Nope! Not at all. WTH! By the time he got home I had to reapply 10x since it just kept sweating off or the oils evaporated lol no idea. Needles to say I'll stick to my banana rum because that seems to work better than this stuff. I won't be ordering again but I did enjoy the little experiment. My husband still has no clue about any of this.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFXD6IUMYKZFMTAOTN77NNQ3SP7Q",
  "timestamp": 1624541467138,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "it has a fruity smell",
  "text": "I really love the smell of this I tried it with my husband but no dice. Still I would buy again smells soo good",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGCBWQGT4UZGAA3LBNTSXLBFI2KA",
  "timestamp": 1614008463902,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "It’s okay",
  "text": "Has a pleasant aroma but no impact on partner",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHGJDC7JI75ZIZMATKSJH7NTTYTQ",
  "timestamp": 1678319963307,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Didn't work.",
  "text": "Scam...",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AECHLQSHBO4IH5W25ABI4VUFRW7Q",
  "timestamp": 1635913797937,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "This thing is the real deal! Do NOT pass this up",
  "text": "The smell is so nice. You can use so much without it being too strong. I roll it on my wrists and behind my ears and it works like a charm every time! And believe me I’ve tested with and without it multiple times to confidently recommend this oil to everyone I know who is trying to respark your love life or kindle a new romance! I bought this as a gift for all my girls love this heaven sent roll on oil",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFY2CLZV24TSXSXQELKDJQJRJUDA",
  "timestamp": 1671918645430,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "“I was going to say you smelled gross but I wanted to be polite”",
  "text": "The smell is horrible and I didn’t notice any difference in how my partner or anyone around me acted towards me. Someone even told me I smelled “weird” and when I began explaining it to them, they said “oh, I was going to say you smelled gross but I wanted to be polite”. 0 stars.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFX27MDHBDNKNVDZKEL2KKMTB3PQ",
  "timestamp": 1631905773029,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Nice smell, husband never noticed it though.",
  "text": "Although the smell was pleasant, it didn’t last more than 1/2 hour and my husband never noticed it, I didn’t tell him the first day, the second day, I told him  to take a big smell and see if he felt anything. He said no, this guy is turned on by as much as hand holding so I don’t think it works romantically..",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AENF7OXMFXQX2PHU3PVEP6SZAUYA",
  "timestamp": 1661431368224,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Meh",
  "text": "It smell good.... for a while<br />But has no affect<br />Well at least on my man it didn't but good before gym perfume so you don't smell sweaty",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHCFOIPMY4LCVNAPD6L7OJQCH4UA",
  "timestamp": 1625767787866,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "smells great",
  "text": "smells great. i was worried i wouldn’t like it as compared to pure romances scent but it makes a very good substitute",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG4KOWOEF36KRAFOCIDYJTD4I5WQ",
  "timestamp": 1616367393081,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It really works lmao",
  "text": "I put this scent on under my regular perfume and went out. I didn't have to buy anything 😂 it was like moths to a flame lmaoo",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFXTX6DHE5PPQDS2URANGQTB3U3Q",
  "timestamp": 1629209956250,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Doesn't last at all",
  "text": "Can't tell you if it works or doesn't cause it literally lasts for less than 10 minutes on skin. The smell is nauseatingly sweet. Not sure where all the great reviews came from, this one will have to go back.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHPSGTQMDSBRAV3NTIVURX7ZQXAQ",
  "timestamp": 1658254969580,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "IT WORKS",
  "text": "UM THIS STUFF WORKS !!!! it smells so nice, it doesn’t last super long, but just carry it with you to reapply, but holy moly the stuff works magic I am not joking…….",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGQ3FTVUGI5Z2SI2LQVJVTS5B4XA",
  "timestamp": 1637469689727,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells good",
  "text": "It's not a strong scent it's subtle but nice.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG7NF3FP2D2YOYRJCQANLR54BSQQ",
  "timestamp": 1641180793248,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Nice scent",
  "text": "Not sure if it works or not (really hope that it works!), because I received this oil today, but I love the smell, which is slightly sweet, floral or fruity maybe. IMHO it's not unisex. This oil is for women. Overall, I'm satisfied.",
  "images": [
    {
      "small_image_url": "https://m.media-amazon.com/images/I/71DNx70E6uL._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/71DNx70E6uL._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/71DNx70E6uL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    },
    {
      "small_image_url": "https://m.media-amazon.com/images/I/71WITYL8v8L._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/71WITYL8v8L._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/71WITYL8v8L._SL1600_.jpg",
      "attachment_type": "IMAGE"
    },
    {
      "small_image_url": "https://m.media-amazon.com/images/I/81GIo4rYQHL._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/81GIo4rYQHL._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/81GIo4rYQHL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEMWU4JB7PZMC74YWZVCOB4JLHCQ",
  "timestamp": 1627132767068,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells great!!",
  "text": "Smell is great and light!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE3BYJSAQR6LUZIEERBLPH5O5CHA",
  "timestamp": 1632263241851,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "I Love it",
  "text": "My husband couldn't care less",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGYK3IKGQPCIV4OH34JRLOJTDDRA",
  "timestamp": 1675259655047,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "He smells one thing, I smell another",
  "text": "He says it smells nice but I don’t really notice a difference than when I’m  wearing that vs. my Victoria secret. Also I got a weird rash where I put it. But i have sensory skin.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFGRXDHOZK66N35GJD6G6BOM25YQ",
  "timestamp": 1619627522129,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "Its hype not facts",
  "text": "The scent is clean and soft but fades away fast",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHWGEDGZU2X3XFLR4YT3WN2T65HQ",
  "timestamp": 1611004202760,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "It’s alright",
  "text": "I’m not completely sure it does anything. Smells like watermelon.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG53IGMF3LIOYJPFPJP7PUXP6G7Q",
  "timestamp": 1672875364664,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Nice smell",
  "text": "Always get compliments smell so good",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE54GY4RJL4BCN3VSXMBXCKC6W4Q",
  "timestamp": 1625208253288,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Smells ok, makes skin BREAK OUT",
  "text": "I was told this scent was the best…it’s really not that special. The day after I rolled it on my neck, the whole area where it was broke out into the most awful acne. If you care about your skin, skip this product!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG4OI5RRL2PHL366EZQKNAT47NCQ",
  "timestamp": 1669400480586,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Great smell. Did it work?",
  "text": "I'm not sure if this actually works but it smells amazing. I still received the same amount of attention from men as I always do with or without this. I don't know if this led to my break up though. I wore this so I could get that same attention I receive from strangers, and get that attention from the father of my children. But he broke up with me the day I wore this saying I \"always look and smell too damn good\" that I was \"too good\" for him and broke things off with me... So did it work? I don't know. But if it did, and that was it's way of working then....damn that sucks<br /><br />Five stars for the smell though! Will purchase again",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF6DXGXJYCJ3FGNHTEK7GEJQZQ2Q",
  "timestamp": 1634404618418,
  "helpful_vote": 3,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It’s super faint??",
  "text": "It smells good, but it’s super faint smelling. I can barely smell it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEPBZKKMS7A3WPAKSCBUDFBY3ARA",
  "timestamp": 1633631029167,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Tik tok made me buy it",
  "text": "Smells like jolly ranchers.............🙄",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEVUJ3T6IBOCEDEP54WDJEL2GTSA",
  "timestamp": 1611291617210,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Doesn't last",
  "text": "Smells really nice. Doesn't last more than a half hour. Even when put on pulse points. This had lots of goid reviews but I'm disappointed",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHL4326Z2P26KVY4LQ227NDKBXOQ",
  "timestamp": 1656767038365,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "🐶 Dog loved it....Fiancé not so much 😅",
  "text": "I'm so disappointed. 😓 My dog kept sniffing my wrists after I applied this and follows me around sniffing my arms a lot now...I guess he likes it? My fiancé didn't notice anything different. I'll continue trying to wear it, but I'm not hopeful...🤦🏽‍♀️ I prefer just wearing the Eilish fragrance",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGHRW6NUKDNYJENM6TM2VLK6YCTQ",
  "timestamp": 1656824528647,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It worked for me",
  "text": "Okay idk what's in this stuff, but it definitely is doing something. Every time I put it on, my man can't keep his hands off me! I mean he normally is pretty touchy-feely with me but on days when I wear this, he be extra obsessed lol I'm so serious. He never mentioned the scent tho but I personally think it smells amazing, and it lasts forever. As I'm typing this I can still smell me and it's been well over 10+ hours.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHYF2ODS6LT4CEOTCMTRIEDYSMCQ",
  "timestamp": 1667306670558,
  "helpful_vote": 3,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Not sure what I expected",
  "text": "Has a floral scent. Not offensive but not quite the seductive scent I was looking for. Definitely a spring dress kinda smell.. I have sensitive skin & it did NOT cause a reaction.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGOLU3RXTMBOLCX5N27L5RSVFJ7A",
  "timestamp": 1650155738275,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Light scent",
  "text": "Rolls on easy and smells good but very light. After an hour I don't smell anything. Leaves a greasy spot where applied.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEYHW76EOSCGXMNOJII5HG5TCOBQ",
  "timestamp": 1680644091651,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Like the Scent!",
  "text": "Love the light scent!  Nobody is crawling all over me, but I do like how this smells on me.  Not over bearing!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGNSQ3SREBNJT45LIETYIUQL66RQ",
  "timestamp": 1571298895917,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love the smell!",
  "text": "I absolutely love the smell of this stuff! It also layers really well under other fragrances and makes them last longer!.<br /><br />I get a lot of compliments on it! Great for daily use and lasts a really long time!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHDWIMANQHQ6GXYOXY344LCGGNKQ",
  "timestamp": 1679874851130,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it",
  "text": "This smell is so lovely. And my husband goes crazy when I wear it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFU4L7ZYE744XAQTI3YKUEEFSIBQ",
  "timestamp": 1589420675260,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Same stuff you get from the stores but cheaper",
  "text": "This smells just like I remember. It’s my secret weapon for job interviews! I had No leaking and No problem with the roller ball. The scent is super light and almost fruity but the only problem is, it doesn’t seem to linger for very long. It’s super pretty though.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF3JP2HAEFLRKXD3YEA6U77CBHIQ",
  "timestamp": 1594124198777,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Love it 😍",
  "text": "Smells great love the product my boyfriend can’t keep his hands off of me. I really don’t have any issues with the products I love the smell I’m obviously obsessed with it Lol actually no complaints here !",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHKKLONECALWJ5CL3NWEQN7I5STQ",
  "timestamp": 1588752895621,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Eh, Headache",
  "text": "The scent gives me a headache, not sure why that’s the case. I have tried it maybe 4 times now and every time I put it on, I get a headache within 5 minutes...<br /><br />The scent is very sweet, the grape note definitely sticks for long. Not sure if it has any impact of attraction from your partner. Overall ok.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHDB3322FX7JFZCJL4XUA7JMNNOQ",
  "timestamp": 1617743554935,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Try it",
  "text": "As described & pictured! Works as it says!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE5FZ4TCGSSBRVCGCPJCREGCIWSQ",
  "timestamp": 1606794823570,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "No good",
  "text": "As the smell is pleasant it doesn’t last for more than two minutes you have to reapplying it. Stuff is a joke don’t waste your money",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AG5XF4CQYEVNXMK2FHKD44RAFNEA",
  "timestamp": 1605279505598,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Great value",
  "text": "The scent is lovely",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AE6LLLMUBXSDA3FSMZP6E2P5FHZQ",
  "timestamp": 1648638010338,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Just buy it!",
  "text": "My husband of 20 years noticed something new right away. He said I smelled amazing and couldn't keep his hands off me.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFKFOILMGBWVDJ7BQBFGJYQEZWLQ",
  "timestamp": 1585053314690,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "It smells the same on everyone",
  "text": "I know there’s a lot of hype about this but I literally put it on myself and a few other people and it smelled the same. It didn’t have a wow effect. It also doesn’t last long at all! I got the original one.  I do like one called Missing person from Sephora, the smell is still growing on me but it’s different and I get a lot of compliments on it.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFO3YP3LP223SJOWFU4475YD7HLA",
  "timestamp": 1681081115335,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Amazing",
  "text": "Absolutely love this scent",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHNH467VG2DELLKO7LAABJXW3LWA",
  "timestamp": 1538774878726,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "No, no, no",
  "text": "Please don’t waste your money on this. Smells awful, like cheap soap, and it doesn’t work at all",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHNADRBU6QLNJJV6G2OJE6YBY62A",
  "timestamp": 1606969182984,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Good, but would not buy again.",
  "text": "It was a good smell, I believe from what I’ve seen in videos it smells different depending on the user. I will say you might need to keep it on hand to reapply as I don’t think it’s scent lasts very long. Other than that I’m satisfied with the product for it’s price, I probably will not buy this again but it’s a neat experiment.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AF3OBSLYSETWYH3W2VAVBWQZS4SQ",
  "timestamp": 1606358792512,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Yuck",
  "text": "Honestly... this smells like dollar store perfume. Save your money girls 👀",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AETQJRH6MQM33IYHFHI5QY7VW3IA",
  "timestamp": 1605405335923,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells really good",
  "text": "Smells so good and works like a charm!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEILAKYCVCSIGXIPGSTOBQKYGHDQ",
  "timestamp": 1603384505913,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "wouldn’t buy again",
  "text": "I didn’t like the smell",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFEXZUEOWLM74LVGVKDHAWJ4L2HQ",
  "timestamp": 1682992838064,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "Free drink, but smells like skunk pee",
  "text": "The day I got this I was super excited. I was thrilled to sneakily attract more men. I opened the bottle with excitement. My dude told me he had something important to tell me that day, I was ready to bust this perfume out and seduce him. I rolled it on my wrists and my neck. It took a bit to get the product out, but at last it came out. In the bottle it smelled like jolly ranchers, it was very sweet. That’s how it smelt on me for a bit. I enjoyed it at first. Then my dude came to get me. He insisted that he take me to sonic so I agreed. Upon arrival, he ordered me a cherry limeade. All was good. Then out of the blue I caught a whiff of my scent. It smelled like straight trees... like I had rolled around in the Forrest and had pine all over. I can’t tell if all the w**d I’d been smoking had made my natural scent turn to trees? It was disgusting. I smelt musty. Then my dude looked me dead in the eyes and told me he was actually into my roommate. I was horrified. So basically with this instinct pheromone perfume, you will smell like skunk, but at least you’ll get a free sonic drink. You might lose your man, but it’s okay. The drink was worth it. (True story, wish it wasn’t though)",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEIXBWWWFPBOK77J4KHIZFO7H6VA",
  "timestamp": 1606943595913,
  "helpful_vote": 639,
  "verified_purchase": true
}
{
  "rating": 4,
  "title": "Four Stars",
  "text": "Ok product",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGXWIZ4VV6IWLBV25FSHD3HX5BRA",
  "timestamp": 1435177722000,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Tiktok made me buy it!",
  "text": "Not gonna lie I got my back blown out after using this... iykyk.. I’m not one to buy things I see on tiktok but I saw this and thought I’d try it out and I love it. it smells so good. It’s very strong but subtle. The scent last for a long time. Got sweaty and the scent was there. Went to sleep and the scent was still there the next day. My bf likes the smell a lot and was all over me",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEZ6BVHUUFU2RYKWQVCLLKAYZWXQ",
  "timestamp": 1604688343837,
  "helpful_vote": 14,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smell is perfect",
  "text": "I love the facts it's a roll-on and that everyone can use it. My man loves it",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AELUMSIIVAX47Y3MMDO4BRISZ56Q",
  "timestamp": 1686592864497,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 3,
  "title": "Nice smell for everyday.",
  "text": "I don't think it works as well as other buyers claim. Sorry. It has a nice clean fresh scent but thats about it. My husband doesn't seem phased.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEVYDUUFBIP2YNYUN5CNVXCBLIJA",
  "timestamp": 1607055237036,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Works like a charm!",
  "text": "This stuff works! I put it on after a shower and my boyfriend couldn't keep his hands off me. Granted my boyfriend told me beforehand that he is susceptible to pheromones so that helped. It's the reason i made the purchase. To me it smells like sweet candy but to him...a different kind of pleasurable aroma. Best purchase I've made in a while.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHAGWOC53KSHRTIX4BCLWZZPECNA",
  "timestamp": 1606193276108,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Tik Tok made me buy it!! :)",
  "text": "This smells divine! It’s definitely very feminine, almost smells like Juicy fruit gum when first applied. It slowly works into your skin and then smells more like a musky vanilla fruit scent. I haven’t tried this to attract men but I do know my cat loves it quite a bit. He couldn’t stop rubbing his head on my wrist. My product did come a bit damaged on the cap, but I would assume that’s from shipping as it didn’t have a lot of protection when I pulled it out of the bubble mailer. Overall, I really love this scent! I’m sad to see the price go up due to the hype it’s getting though, these used to be $7 a bottle but now they’re $14.",
  "images": [
    {
      "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61MWTiDRc3L._SL256_.jpg",
      "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61MWTiDRc3L._SL800_.jpg",
      "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61MWTiDRc3L._SL1600_.jpg",
      "attachment_type": "IMAGE"
    },
    {
      "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61tcKb7q+IL._SL256_.jpg",
      "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61tcKb7q+IL._SL800_.jpg",
      "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61tcKb7q+IL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEUCJTWWSF7FPFCIXSN4DFUJXXOQ",
  "timestamp": 1604090031644,
  "helpful_vote": 2,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "It absolutely smells amazing!!!!",
  "text": "The bottle is a decent-size, it came undamaged and smells exactly like pure romance Basic Instinct for way less money!!!!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGVBENVCPLPXLMX6ZDKEHKLPA66A",
  "timestamp": 1532711478733,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 2,
  "title": "No thanks.",
  "text": "Not a fan. Didn’t smell horrible but did NOT smell good. I have no clue why this product is so hyped up.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AGD34JKYX45XIQSSDTYCBAJRDENA",
  "timestamp": 1606168810160,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smell like a goddess",
  "text": "This is a game changer Sarah Moe sent you’ll be turning heads as you walk through the door.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFQEYDFPFWJJ45A3IYJL5GY64GGA",
  "timestamp": 1684938674382,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 1,
  "title": "It stinks.",
  "text": "I got this product to see if my husband would be more attracted to me when we would get together. Well, this product did nothing for me. Maybe my chemistry is not the indicated for this scent to work properly. It really was a waste of money. I did not return it on time because I wanted to give it several tries, meaning during the night, during the day, after a shower. The ones for the nighttime, made me even to get nauseous.  As I said earlier, it might just be my chemistry, that is not compatible with this perfume.",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEAVEGPFLZXERXUCOWT3Z24BRUVQ",
  "timestamp": 1682479901502,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "10/10",
  "text": "I bought this, thinking “why not” and IT WORKSSSSSSS! Not only does it smell good, but my husband couldn’t keep his hands off me! Definitely a great buy!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AFMCUM3RKLUFNPRAOPUUUVGXVZYA",
  "timestamp": 1693244040320,
  "helpful_vote": 0,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "Smells great!",
  "text": "I'm not sure if it actually works but it's smells amazing!",
  "images": [],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AEQZNTPDETRO54BTPKLDUCBXBBOA",
  "timestamp": 1682098585631,
  "helpful_vote": 1,
  "verified_purchase": true
}
{
  "rating": 5,
  "title": "I keep buying this",
  "text": "I love this mixed with my perfume. I get compliments on my scent often. This is my 3rd bottle of it. Rolls on, compact perfect for a purse. Don't leave it in heat it will evaporate.",
  "images": [
    {
      "small_image_url": "https://m.media-amazon.com/images/I/81sr-o-S9wL._SL256_.jpg",
      "medium_image_url": "https://m.media-amazon.com/images/I/81sr-o-S9wL._SL800_.jpg",
      "large_image_url": "https://m.media-amazon.com/images/I/81sr-o-S9wL._SL1600_.jpg",
      "attachment_type": "IMAGE"
    }
  ],
  "asin": "B00EJDG7XI",
  "parent_asin": "B0BLGN9N39",
  "user_id": "AHSDCB7PGGTMM5VW2L3XOUBPIS5A",
  "timestamp": 1693248666042,
  "helpful_vote": 0,
  "verified_purchase": true
}
